[
    {
        "_comment": "爬取时长1分钟左右,308个视频，2025/7/23"
    },
    {
        "title": "A.I. Validates What Jesus Knew About the Book of Daniel | Marking the End Times",
        "description": "I want to share a stunning discovery today that drives a nail in the coffin of \none of the most persistent attacks against Bible prophecy. For almost 1,700 \nyears, since a pagan philosopher named Porphyry in the 3rd century AD, \nmany scholars have claimed the Book of Daniel was written after the events \nit “predicts” already happened. They call this ex eventu or “after the fact,” \nclaiming Daniel is really history masquerading as prophecy.\nThis matters enormously because Daniel is the key prophetic book in the \nOld Testament—often called the Old Testament Book of Revelation. But \nresearchers using AI machine learning called “Enoch” have conclusively \ndated a Dead Sea Scroll copy of Daniel (manuscript 4Q114) to be at least \n100 years earlier than previously believed—placing it firmly in the 3rd \ncentury BC. This means Daniel couldn’t possibly have been written in the \n2nd century BC as skeptics have claimed, since we now have copies existing\nbefore those events even occurred! This powerfully supports the traditional \n530 BC date when Daniel himself wrote it in Babylon. Most importantly, \nJesus Himself confirmed Daniel’s authorship in Matthew 24:15, which \nshould settle the issue for all believers.\n-------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/Kh7Nhp2kzTw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Kh7Nhp2kzTw",
        "duration": "PT9M29S",
        "published_at": "2025-07-17T11:30:15Z"
    },
    {
        "title": "False Signs and Wonders in the Age of A.I. | Marking the End Times",
        "description": "This week I'm addressing a stunning development that shook governments worldwide—an AI-generated deepfake impersonating Secretary of State Marco Rubio successfully contacted five high-level officials, including three foreign ministers. This isn't just a tech story; it's prophetic. AI's ability to deceive is unparalleled in history, and I believe it will be unparalleled in prophecy when the Antichrist harnesses it for his global campaign of deception.\nWhile AI isn't the Antichrist—he's a person, the \"man of sin\"—it will be his perfect tool. We're witnessing the potential for deception on a scale never imagined, where truth and falsehood become indistinguishable. Some are already worshipping ChatGPT as divine, calling it \"robo-theism.\" This feels like another Tower of Babel moment where God said, \"Nothing they plan to do will be impossible for them.\"\nSatan, the master globalist, has worked since Babel to reunite the world under one man. Through AI and globalism, we're back to that point. Just as God stepped in at Babel saying \"enough,\" I believe He could be preparing to send His Son for His bride very soon, before this deception reaches its ultimate expression through the coming Antichrist.\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/gvMEmSFE7fI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=gvMEmSFE7fI",
        "duration": "PT7M25S",
        "published_at": "2025-07-10T11:30:40Z"
    },
    {
        "title": "The “Destroy Israel” Clock | Marking the End Times",
        "description": "Today I discuss not the famous Doomsday Clock created by atomic scientists\nin 1947, but a far more sinister timepiece—Iran’s “Destroy Israel” Clock \nthat sat in Tehran’s Palestine Square until just a few days ago. This massive \ndigital billboard counts down the days until September 21, 2040, when \nIran’s Supreme Leader predicts Israel will cease to exist. The clock displays \n“Only [X] days remaining to the annihilation of Israel” in Farsi, English, and \nArabic, featuring a Palestinian flag-colored fist punching through an Israeli \nflag.\nIsrael claims they destroyed this clock in their June 23rd airstrike during \ntheir twelve-day war with Iran, though Iran disputes this with unverified \nfootage. Whether the physical clock survived matters less than what it \nrepresents—Iran’s doomsday theology remains intact. This isn’t mere \npolitical rhetoric; it’s apocalyptic ideology woven into their core beliefs \nabout the coming of the Mahdi, their hidden twelfth Imam. Iranian \ntheologians consistently teach that before the Mahdi appears, there will be \nno Jewish state. This explains why any Middle East peace will be temporary\n—Iran will use peaceful periods simply to reload. As Ezekiel 38 prophesies, \nIran will ultimately be part of the end-times coalition against Israel, making \ntheir current hatred both predictable and prophetic.\nToday I also addressed three important theological questions from \nsubscribers. The first asked me to define dispensationalism versus non-\ndispensationalism and provide arguments for the dispensational position. \nThe second question challenged why we use the word “predict” when \ndiscussing Bible prophecy, arguing it lacks authority compared to weather \nforecasting and occult predictions, when God’s prophecies are absolute and \nauthoritative. The final question referenced a Matt Chandler quote about \nRevelation being given to encourage believers for 2000 years rather than \njust informing about the End Times. These questions touched on \nfundamental issues of biblical interpretation, prophetic terminology, and the\npractical relevance of the Bible’s prophetic literature\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/Z0GyG-6RmRI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Z0GyG-6RmRI",
        "duration": "PT8M58S",
        "published_at": "2025-07-03T11:34:04Z"
    },
    {
        "title": "Geopolitical Whiplash in the Sudden Shift from War to Peace | Marking the End Times",
        "description": "This week has been prophetically extraordinary—I can’t remember a more \nsignificant week in terms of end-times events. What we’ve been predicting \nfor years based on God’s Word has finally happened. Israel and Iran \nexploded into open warfare, culminating in President Trump’s devastating \nOperation Midnight Hammer against Iran’s nuclear facilities. Then, out of \nnowhere, a ceasefire was announced and the 12-day war appears to be over.\nWhile everyone focuses on war, I believe what’s happening could be a \nprelude to unprecedented regional peace since Israel’s founding. The Bible \npredicts both wars and peace for the End Times—Daniel 9:27 speaks of a \nseven-year peace treaty the Antichrist will forge with Israel. What we’re \nwitnessing could be the beginning stages of that framework. The sudden \nshift from potential World War to peace talks is stunning geopolitical \nwhiplash. All the puzzle pieces are falling into place: Israel’s in their land, \nIran and Russia are aligned, Europe is rising in power, and now peace is \ntaking shape. Our world looks more like the Bible’s prophetic picture than \never before.\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/Py3KHBqX1wc/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Py3KHBqX1wc",
        "duration": "PT6M29S",
        "published_at": "2025-06-26T11:30:16Z"
    },
    {
        "title": "Operation Rising Lion | Marking the End Times",
        "description": "Today I’m examining the escalating Israel-Iran war that’s been brewing for \n46 years since Iran’s 1979 Islamic revolution and their motto “Death to \nIsrael, Death to America.” With Iran standing at the nuclear threshold after \n36 years of pursuing nuclear weapons, Israel launched Operation Rising \nLion as a preemptive strike against this existential threat. While this isn’t \nthe direct fulfillment of Bible prophecy, it’s creating striking foreshadows of \nwhat’s coming. Iran has been systematically losing their missile launchers \nat about 8% per day, though some hypersonic missiles are penetrating \nIsrael’s multi-layered defense systems. This conflict is the greatest \naccelerant to the Ezekiel 38 Gog-Magog war I’ve seen in 30 years. I also \naddress viewer questions about planetary alignments and papal names, Old \nTestament saints’ destinations after death, whether deceased loved ones \ncan see us from Heaven, and Jesus’ statements about raising believers “at \nthe last day” and how this relates to the timing of the Rapture.\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/Nyfs1krsWyo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Nyfs1krsWyo",
        "duration": "PT7M57S",
        "published_at": "2025-06-19T11:56:40Z"
    },
    {
        "title": "From Palestinian Statehood to the Two Witnesses | Marking the End Times",
        "description": "Today, I examine three interconnected Middle East storylines pointing toward the End Times. First, the mounting pressure for Palestinian statehood recognition, with 146 of 193 UN member nations supporting it and French President Macron leading a UN conference to explore Palestinian state creation. Ambassador Mike Huckabee's controversial suggestion that Muslim countries create a Palestinian state on their territory represents a sharp departure from decades of US policy. Second, President Trump's pressure on Prime Minister Netanyahu to end the Gaza war while blocking Israeli strikes on Iran during ongoing nuclear negotiations. Iran continues its delay tactics while enriching uranium to 60% purity—enough for nine nuclear weapons if enriched further. Third, Iran's claims of possessing Israeli nuclear intelligence and threats to target Israeli sites. These crises are setting the stage for the Antichrist's meteoric rise to solve this diplomatic Rubik's Cube. \n\nNext, I address the identity and ministry of the Two Witnesses in Revelation 11:3–14. The main questions center on who these witnesses are and when they will minister. I argue they are real people, not symbolic representations, based on their physical actions described in the Bible. While some believe they're Enoch and Elijah (since neither died) or unnamed future individuals, I present evidence they are Moses and Elijah—Moses because the witnesses turn water to blood and call down plagues like he did in Egypt, and Elijah because they shut up the sky preventing rain, call down fire from Heaven, and Malachi predicts Elijah's return before the great day of the Lord. Regarding timing, though many place their ministry in the first half of the Tribulation, I lean toward the second half because the temple trampling (42 months) and their prophesying (1,260 days) are mentioned consecutively with the same time period, and the Seventh Trumpet sounds immediately after their ministry ends.\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/U0tXawSzVMw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=U0tXawSzVMw",
        "duration": "PT7M24S",
        "published_at": "2025-06-12T11:30:23Z"
    },
    {
        "title": "Ukraine’s Spider's Web Attack | Marking the End Times",
        "description": "Today, I examine Ukraine's shocking \"Spider's Web\" drone attack against four Russian airfields—being called the most audacious military operation in history. Using 117 inexpensive toy-like drones costing just hundreds of dollars each, Ukraine inflicted $7 billion in damage to Russian strategic assets, including nuclear bombers located 2,500 miles from the Ukrainian border. This humiliating blow to Russia has redefined modern warfare and demonstrates how cheap drone technology could revolutionize future conflicts. I explore how the wounded Russian bear may become more dangerous and aggressive, potentially accelerating the prophetic timeline toward the Gog and Magog invasion of Ezekiel 38-39. This attack may be Russia's Pearl Harbor, but ultimately points toward Israel's future Pearl Harbor.\n\nIn the second part of this episode, I address four important subscriber questions about end-times prophecy. The first concerns the timing of the Two Witnesses in Revelation 11 and how they can witness during the Tribulation's second half if killed midway through. I explain that I place their ministry in the second half based on the parallel 42-month timeline with the Temple's trampling. Another subscriber asks whether Jesus raised a fourth person from the dead, referencing the mysterious young man in Mark 14:51. I clarify that Scripture records only three resurrections by Jesus, and that passage likely describes Mark himself fleeing. A third question explores whether AI could embody the Antichrist. I firmly explain that Scripture portrays the Antichrist as a literal human being who will use technology extensively but isn't technology itself. Finally, someone asks about the current location of deceased believers' souls. I teach that believers' souls immediately enter Christ's presence upon death while their bodies await future resurrection and glorification at the rapture.\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/YaQEBVxbTUI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=YaQEBVxbTUI",
        "duration": "PT6M53S",
        "published_at": "2025-06-05T11:30:35Z"
    },
    {
        "title": "The Temple That Must Be Built | Marking the End Times",
        "description": "In this episode, I examine two significant prophetic developments: Trump's \nplan to relocate over 1 million Palestinians from Gaza to Libya, and the \ncoming third Jewish Temple described in Revelation 11:1–2. With Israel now\ncontrolling 77% of Gaza and killing Hamas chief Mohammed Sinwar, \nattention turns to post-war Gaza. President Trump's administration is \nreportedly working with Libya to permanently resettle Palestinians there in \nexchange for releasing billions in frozen Libyan assets. This is prophetically \nsignificant because Libya is specifically mentioned in Ezekiel 38 as part of \nthe Gog-Magog coalition against Israel. I explain how 1 million displaced \nPalestinians in Libya would create a hotbed of hatred against Israel, making\nLibya an eager participant in the future invasion. In our Revelation study, I \nexplore how the Temple mentioned in 11:1–2 refers to a literal Third Temple\nthat must be built before the Antichrist's mid-Tribulation desecration, \nexamining current preparations and possible scenarios for its construction \non the Temple Mount\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/N7Y83bSQiRE/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=N7Y83bSQiRE",
        "duration": "PT7M26S",
        "published_at": "2025-05-29T11:30:16Z"
    },
    {
        "title": "Zero Hour for Iran's Nuclear Ambitions | Marking the End Times",
        "description": "In this week's episode I discuss the increasing intelligence reports \nsuggesting Israel is preparing to strike Iran's nuclear facilities. This appears\nto be a critical moment as Israel sees a window of opportunity with Iran in \nits weakest military position in three decades. I explain how Israel has \nalready weakened Iran by bombing its missile production facilities and air \ndefenses, while U.S. sanctions have crippled Iran's economy. Additionally, \nIsrael has decimated Iran's regional proxies. This potential strike could \ndisrupt President Trump's diplomatic efforts with Iran and risk escalating \nthe conflict in Gaza to a wider Middle East war. I examine how this situation\nmight be setting the stage for the Gog-Magog war prophesied in Scripture, \nwhere Iran and other nations including Turkey will come against Israel in \nthe End Times.\nIn the second segment of our program, I address several fascinating \nquestions from our subscribers: How does the birth year of Jesus affect the \n70 weeks prophecy in Daniel 9:24–27? How do we understand Jesus' \ngenealogy as recorded in Matthew and Luke, particularly regarding His \ndescent from David through both Joseph and Mary? Does Revelation 3:5's \nreference to not erasing names from the Book of Life imply that some \nbelievers could lose their salvation? And finally, regarding the two witnesses\nof Revelation 11, who are they likely to be—Elijah and Enoch, or Elijah and \nMoses—especially considering Hebrews 9:27 states it's appointed for man \nto die once?\n\n-------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/nCAE9zXQOV4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=nCAE9zXQOV4",
        "duration": "PT6M10S",
        "published_at": "2025-05-22T11:30:42Z"
    },
    {
        "title": "Trump’s Whirlwind Middle East Tour | Marking the End Times",
        "description": "In this episode, I examine President Trump’s historic visit to Saudi Arabia, \nQatar, and the UAE, and how these developments are shaping the prophetic \nlandscape. I explore the president’s pursuit of massive economic deals, \nreportedly seeking up to $1 trillion in investments from Gulf nations. Behind\nthese economic initiatives lies the potential for Saudi Arabia to join the \nAbraham Accords, normalizing relations with Israel. I discuss how Saudi \nArabia’s ambitious Vision 2030 plan to diversify from oil and become a \nglobal AI leader outside the U.S. fits into end-time scenarios. These Gulf \nstates’ alignment with the West perfectly matches Ezekiel 38:13, which \ndescribes “Sheba and Dedan” (Saudi Arabia) as separate from the Russian–\nIranian coalition. After analyzing these current events, I continue our study \nof Revelation with chapter 10, examining the mighty angel, the seven \nthunders, and the little book John was commanded to eat—powerful \nsymbols of God’s sovereignty and the importance of assimilating His Word \ninto our lives\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/e6gtZ_3t5I0/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=e6gtZ_3t5I0",
        "duration": "PT7M27S",
        "published_at": "2025-05-15T11:30:26Z"
    },
    {
        "title": "The Ancient Gaza Prophecy | Marking the End Times",
        "description": "In this episode, I examine Israel’s stunning announcement to call up \nthousands of reservists with plans to capture Gaza and occupy it \nindefinitely. As Israel’s security cabinet approves this dramatic escalation \nahead of President Trump’s mid-May Middle East visit, I explore the \nprophetic implications through the lens of Zephaniah 2:4–7. This 2,600-\nyear-old prophecy specifically mentions Gaza being abandoned and the \ncoastline becoming “pastures with shepherds’ caves” for “the remnant of \nthe house of Judah.” While I don’t believe in double fulfillment of \nprophecies, I see what’s happening today as a powerful foreshadow of \nZephaniah’s vision—just as the Babylonian invasion in his day prefigured \nthe ultimate Day of the Lord. With Israel planning to “flatten any buildings \nthat remain standing” and displace Gaza’s population to a humanitarian \narea, we may be witnessing a modern parallel to ancient prophecy—a \nprecursor to the final Day of the Lord and the restoration of Israel in the \nMillennial Kingdom.\nOur Q&A segment addresses several intriguing biblical questions. One \nviewer wonders why both the Rapture and Christ’s return after the \nTribulation are referred to as the “Second Coming,” creating potential \nconfusion about the timeline of prophetic events. Another question explores \nthe 200 million-strong army mentioned in Revelation 9:16 and whether they \nmight initially come to war against the Beast rather than serving him. We \nalso received a historical inquiry about the tribes of Reuben, Gad, and half \nthe tribe of Manasseh who stayed east of the Jordan River, asking if their \ndescendants remain there today. Finally, two fascinating questions relate to \nthe 70 Weeks prophecy in Daniel 9:24–27, specifically about calculating the \ndates between Artaxerxes’ decree and Jesus’ Triumphal Entry, and how to \nreconcile what appears to be a mathematical discrepancy in the 483-year \ntimespan.\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/pPq1eIRr2-o/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=pPq1eIRr2-o",
        "duration": "PT10M48S",
        "published_at": "2025-05-08T11:30:40Z"
    },
    {
        "title": "The First AI War | Marking the End Times",
        "description": "In this episode of, I examine the revolutionary use of artificial intelligence in\nIsrael’s conflict with Gaza. What experts are calling the “first AI war” \nrepresents a quantum leap in warfare capabilities, with Israel employing \nsophisticated AI systems like “The Gospel,” “Lavender,” and “Where’s \nDaddy?” to identify targets, track militants, and speed up military \noperations. What once took 20 intelligence officers 250 days can now be \naccomplished in a single week. This technological revolution is transforming\nthe Middle East into an “AI Warfare Laboratory,” which is particularly \nsignificant as Bible prophecy identifies this region as the epicenter of end-\ntimes events. I believe what we’re witnessing is just the beginning—a pale \npreview of future warfare that aligns with Revelation 13:4, which asks, \n“Who is able to make war with him?” concerning the Antichrist’s \nunprecedented military power. AI warfare has arrived, and the implications \nfor prophecy are profound.\nIn our Q&A segment, I address several thought-provoking questions from \nlisteners. The first question explores whether saints in Revelation 7 holding \npalm branches and wearing white robes suggests they have physical bodies \nin Heaven before the resurrection. The second question is about the \n144,000 mentioned in Revelation 14 and when they sing before the throne \nand living creatures. Another listener is looking for recommendations for \naccessible, biblically-sound resources for studying Revelation \nindependently. The final question examines 2 Thessalonians 2:3, specifically \nwhether the word “apostasy” was consistently translated as “departure” in \npre-1611 Bible versions, and how this translation choice might impact \ninterpretations of the Rapture timeline.\nPersonal Reflection\n1. How does the rapid advancement of AI in warfare challenge my \nunderstanding of Bible prophecy, particularly regarding the \nAntichrist’s global control?\n2. In what ways might I be witnessing the early stages of the \n“apostasy” or falling away mentioned in 2 Thessalonians 2:3 in \ntoday’s world?\n3. How should biblical prophecy about surveillance and control under\nthe Antichrist influence my perspective on today’s technological \n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/aKtB0OfnCwk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=aKtB0OfnCwk",
        "duration": "PT6M37S",
        "published_at": "2025-05-01T11:30:01Z"
    },
    {
        "title": "The Pope’s Death and the 200 Million Army | Marking the End Times",
        "description": "In today’s program, I examine the death of Pope Francis and address the \nswirl of prophecies and predictions surrounding both his death and his \nsuccessor. I specifically focus on the 12th-century “Prophecy of the Popes” \nby Saint Malachy and predictions from Nostradamus, both of which are \nreceiving significant attention in the media. After noting some of Pope \nFrancis’s concerning theological positions that contradicted Scripture, I \nexplain why these extra-biblical prophecies consistently fail while biblical \nprophecy remains 100% accurate. As followers of Christ, we must resist the \ntemptation to seek “insider knowledge” beyond Scripture and instead trust \nin the prophetic word that’s “more sure.”\nIn the second half of the program, I continue our study of Revelation by \nexamining the sixth trumpet judgment in Revelation 9:13-21, which \ndescribes a 200 million-strong army that kills one-third of mankind—\npossibly a demonic army rather than human forces that will unleash \nunprecedented destruction during the Tribulation.\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/PvOfotB9Ys8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=PvOfotB9Ys8",
        "duration": "PT7M20S",
        "published_at": "2025-04-24T11:30:33Z"
    },
    {
        "title": "This is The End | Marking the End Times",
        "description": "Why I Am a Premillennialist, Pt. 2\n\nIn today’s program, I complete our two-part series on why I believe in premillennialism and why I think you should too. I present the remaining four points of my “PRE-MIL” acronym: E for “Earliest view in church history”; M for “Most natural reading” of Revelation 20; I for “Incarceration of Satan”; and L for “Literal 1000 years”\n\nAfter establishing this biblical foundation for premillennialism, I begin our study of Revelation 9:1–12, examining the fifth Trumpet Judgment which unleashes horrifying demonic locusts from the abyss who torment unbelievers for five months during the Tribulation—truly making this the most bizarre chapter in the Bible.\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/dWYsjnmqqNk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=dWYsjnmqqNk",
        "duration": "PT6M38S",
        "published_at": "2025-04-17T11:30:37Z"
    },
    {
        "title": "Why I Am a Pre-Millennialist | Marking the End Times",
        "description": "In this week’s program, I begin a special two-part series explaining why I \nbelieve in pre-millennialism and why I think you should too. I outline the \nthree main views of the Millennium – amillennialism, postmillennialism, and\npremillennialism – and explain their key differences. While all three views \nagree that Jesus is King and will return to judge the earth, they differ on the\ntiming and nature of Christ’s Reign. I present the first two reasons from my \n“PRE-MIL,” an acronym I use to explain why pre-millennialism is the most \nbiblically sound position: P stands for “Promises of God” (only pre-\nmillennialism allows for the literal fulfillment of God’s Covenants with \nAbraham and David), and R represents “Retribution against the false \ntrinity” (it makes more sense that God deals with the Antichrist, False \nProphet, and Satan in sequence). In the second part, I’ll continue with the \nremaining four points of this important biblical teaching.\n\nToday’s questions cover the following: Whether the “little horn” in Daniel \nrefers to the Antichrist being physically small); clarify the 70 weeks \nprophecy in Daniel 9; discuss the potential casualties from the Rapture; \nexplore whether non-believers will hear the trumpet and archangel’s voice \nat the Rapture: and explain how people saved during the Millennium will be\njudged.\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/K1YObU58lPA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=K1YObU58lPA",
        "duration": "PT6M28S",
        "published_at": "2025-04-10T11:30:24Z"
    },
    {
        "title": "Egypt vs. Israel: The Coming Showdown | Marking the End Times",
        "description": "In this episode, I take a look at the escalating tensions between Egypt and \nIsrael as Egypt violates the 1979 peace agreement by building unauthorized\ninfrastructure and increasing troop levels in the Sinai Peninsula. I outline \nEgypt's long history as Israel's oldest enemy, from the 400 years of captivity\nto their participation in multiple modern wars against Israel. Though they \nhave maintained a technical peace since 1979, I explain that this is more \naccurately described as “lack of war” rather than true peace, with 85% of \nEgyptians opposing diplomatic recognition of Israel. Looking at Bible \nprophecy, I detail Egypt's future role in the Tribulation, where as the “King \nof the South” they will lead a North African confederacy against Israel, \nresulting in their destruction before many Egyptians ultimately turn to the \nLord.\nIn our Revelation study, I examine the first four Trumpet Judgments in \nchapter 8:1–12, beginning with Heaven's ominous half-hour silence before \ncatastrophe strikes. I show how saints' prayers actually trigger these \njudgments, then analyze the four trumpets: devastating wildfires, seas \nturning to blood, poisoned fresh water, and darkened skies. These aren't \nsymbolic or nuclear events, but supernatural judgments from God during \nthe Tribulation's second half. I conclude with an urgent reminder that Jesus \nis our only refuge from these coming horrors.\n\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/-7xb6I8T7oI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=-7xb6I8T7oI",
        "duration": "PT8M18S",
        "published_at": "2025-04-03T12:25:12Z"
    },
    {
        "title": "The EU Superpower | Marking the End Times",
        "description": "In this episode, I examine the stunning rise of Europe economically, politically, and militarily as a potential fulfillment of Bible prophecy. I explore how Daniel chapters 2 and7 and Revelation 17 predict the emergence of a revived Roman Empire in the End Times that will serve as the foundation for the Antichrist’s rise to power. Looking at current events, I analyze Europe’s unprecedented military build-up. The European Union has become an economic titan, surpassing both China and the US. As Europe shifts away from American dependence following the Ukraine conflict, it’s moving toward superpower status—yet currently lacks a charismatic leader to unite its diverse nations. I explain how this aligns perfectly with biblical prophecy about the Antichrist rising from a ten-king coalition within the revived Roman Empire.\n\nIn the Q&A segment, I answer questions about finding peace during uncertain political times, why Jesus commanded silence after certain miracles, the theological meaning of darkness in Genesis 1, and the Ice Age from a biblical perspective. Drawing from Scripture, particularly Psalm 46 and passages about God’s sovereignty, I offer biblical insights to address common concerns about end-times events, fear, and how to maintain a proper theological understanding of creation and God’s presence.\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/M5qz5Zteeb0/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=M5qz5Zteeb0",
        "duration": "PT4M57S",
        "published_at": "2025-03-27T11:30:15Z"
    },
    {
        "title": "Antichrist Temple Prophecies Unveiled | Marking the End Times",
        "description": "In today’s program, I explore the fascinating connection between the \ncoming Antichrist and the future Third Temple that will be built on \nJerusalem’s Temple Mount. Drawing from my recent studies in Exodus \nabout the Tabernacle, I share insights about the Ark of the Covenant—that \nsacred wooden chest topped with golden cherubim where God’s presence \nwas enthroned in the Holy of Holies. This background sets up a powerful \nrevelation from 2 Thessalonians 2, where Scripture tells us the Antichrist \nwill “take his seat in the temple of God.” The implications are striking: this \ncoming world leader will commit the ultimate blasphemy by usurping God’s \nvery throne on earth. Whether the original Ark is recovered from beneath \nthe Temple Mount or a replica is built, the Antichrist will declare himself \nsuperior to the God of Israel from the very spot where God’s presence once \ndwelt.\nThe second portion of our program continues our ongoing exposition of the \nbook of Revelation, focusing on the great multitude of Gentile believers \ndescribed in chapter 7:9–17. Unlike the precisely numbered 144,000 Jewish \nwitnesses, this innumerable multitude represents Gentiles from every \nnation saved during the Tribulation—likely through the evangelistic efforts \nof those 144,000 sealed Jews. Their presence in Heaven, clothed in white \nrobes and holding palm branches, reveals God’s mercy even amid judgment.\nI emphasize that while many will come to faith after the Rapture, waiting to \ntrust Christ is extremely dangerous—both because we don’t know when \nwe’ll die and because salvation will be much harder during that terrible \ntime. These Tribulation martyrs, having “washed their robes in the blood of \nthe Lamb,” remind us of our responsibility to believe and appropriate what \nChrist has done for us.\n\n--------\n#ThirdTemple #Antichrist #ArkOfTheCovenant #TempleMountJerusalem \n#EndTimesProphecy #Revelation7 #MarkHitchcock \n#AbominationOfDesolation #TempleDesecration #HolyOfHolies \n#BibleProphecy #TribulationSaints #2Thessalonians2 #TempleWorship \n#JewishTemple #PropheticFulfillment #EndTimesEvents \n#TribulationPeriod #ExodusTabernacle #RaptureReadiness\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/CHpV9M7hLSg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=CHpV9M7hLSg",
        "duration": "PT5M16S",
        "published_at": "2025-03-20T11:30:14Z"
    },
    {
        "title": "Trump's Final Warning to Iran | Marking the End Times",
        "description": "In today's program, I examine President Trump's ultimatum to Iran \nregarding its nuclear program. Experts worldwide agree that 2025 appears \nto be the decisive year for Iran's nuclear ambitions, with the IAEA \nconfirming they now possess enough 60% enriched uranium for six nuclear \nweapons. Trump has sent a letter to Iran's Supreme Leader seeking a \n“verified nuclear peace agreement,” warning that the alternative would \n“blow Iran into smithereens.” Both paths—peace or conflict—could \nultimately set the stage for the Gog-Magog invasion prophesied in Ezekiel \n38–39. Whether Iran strengthens through peace or seeks revenge after \nstrikes, God's sovereign timeline is unfolding before our eyes.\nDuring our Q&A segment, I addressed several questions. Subscribers asked \nabout recommended resources for understanding Matthew 24, which Bible \ntranslations most accurately reflect the original texts, whether Jesus will \nmaintain His humanity throughout eternity, if the Church must become \n“spotless” before the Rapture can occur, and the complex passage in 2 \nThessalonians 2 regarding the “restrainer” and apostasy. These thoughtful \nquestions reveal the depth of interest many believers have in properly \ninterpreting Bible.\n\n#MarkHitchcock #IranNuclear #TrumpUltimatum #PropheticTimeline \n#MarkHitchcock #EndTimesProphecy #GogMagogWar #BiblicalProphecy \n#Rapture #PreTribulation #EzekielProphecy #HolySpirit #Restrainer \n#BibleTranslations #JesusGodMan #2Thessalonians2 #Matthew24 \n#RaptureReadiness #BrideOfChrist #EndTimesQA #propheticfulfillment \n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/3efAGvoCbHo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=3efAGvoCbHo",
        "duration": "PT5M15S",
        "published_at": "2025-03-13T11:30:03Z"
    },
    {
        "title": "From Tanks to Horses | Marking the End Times",
        "description": "In today’s episode, I discuss an astonishing development in the Russia-\nUkraine conflict that caught my attention. Russia has begun using horses, \ncamels, and donkeys to transport troops and supplies due to the depletion \nof their military equipment—the largest in 80 years. I analyze how this \nconnects to Ezekiel 38’s prophecy of the Gog-Magog invasion, which \ndescribes soldiers on horseback using ancient weapons. This addresses a \ncommon question about end-times prophecy: Why would modern armies use\nprimitive transportation? I explore three interpretations: (1) that Ezekiel \nused terms his audience could understand, (2) that nations might revert to \narchaic methods due to resource depletion, or (3) that the rise of drone \nwarfare might render expensive tanks obsolete. Whatever the explanation, \nall prophesied nations are currently in place for this future invasion.\nThe second part of the program continues our ongoing exposition of \nRevelation, focusing on chapter 7:1–8 and the mysterious 144,000. I explain\nhow this passage answers the question posed at the end of chapter 6: “Who \nis able to stand?” during God’s wrath. These 144,000 are literally Jewish \nmen—12,000 from each of the twelve tribes—who will be sealed by God for \nprotection during the Tribulation. I clarify common misconceptions, \nexplaining they are not Seventh-day Adventists, Jehovah’s Witnesses, or \nsymbolic of the Church. God will use these men as powerful evangelists\n—”144,000 Billy Grahams”—to reach countless Gentiles. This demonstrates \nGod’s faithfulness to preserve the Jewish people throughout history and His \ncontinuing work of salvation even during earth’s darkest hour. These sealed \nJews will fulfill Jesus’ prophecy that the gospel will be preached to all \nnations before the end.\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/RDifpRY1CsM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=RDifpRY1CsM",
        "duration": "PT6M14S",
        "published_at": "2025-03-06T12:30:24Z"
    },
    {
        "title": "Peace Before the Storm | Marking the End Times",
        "description": "Today I want to challenge a common misconception about the End Times—\nthat the world will be in chaos when the Rapture occurs. In light of the \nremarkable peace negotiations happening around Russia-Ukraine and \nIsrael-Hamas conflicts, we need to revisit what the Bible actually tells us. In \n1 Thessalonians 5:1–3 Paul reveals that the Tribulation will begin when \npeople are saying “peace and safety.” This means that rather than expecting\nglobal turmoil before the Rapture, we might actually see unprecedented \npeace efforts succeeding. The world could be living under the delusion that \nall is well when Christ suddenly returns for His Church. These current \npeace negotiations may be setting the stage for that brief period of false \nsecurity before the Tribulation judgments begin.\nIn our Q&A portion, I address several thoughtful questions from \nsubscribers. I explain the historical development of our BC/AD dating \nsystem and why Bible chronology appears to “count backward.” I \nrecommend resources for those wanting to study the Bible more effectively \ndespite not being avid readers. I also tackle a question about the pre-wrath \nRapture view compared to the pre-Tribulation position, explaining why the \nentire seven-year Tribulation constitutes God's wrath. Finally, I clarify \nprophecies regarding Damascus and Elam (modern Iran), distinguishing \nbetween historical fulfillments and potential future events.\n\n#EndTimesPeace #RaptureTiming #BibleProphecy #FirstThessalonians5 \n#TribulationBeginning #PeaceAndSafety #MarkHitchcock \n#ProphecyTeaching #MiddleEastPeace #EndTimesMisconceptions \n#PreTribRapture #BiblicalChronology #DamascusProphecy \n#RussiaUkrainePeace #IsraelPeace #BibleStudyMethods \n#PropheticFulfillment #ElamProphecy #IranProphecy #BibleEschatology\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/hm-8jr25cmc/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=hm-8jr25cmc",
        "duration": "PT7M55S",
        "published_at": "2025-02-27T12:30:42Z"
    },
    {
        "title": "What Will We Do in Heaven? | Marking the End Times",
        "description": "Today I'm addressing a deeply personal question that's been on my heart since losing both my parents in less than a year: What are our loved ones doing in Heaven right now? Drawing from Scripture, I'll explore seven key activities that mark eternal life, from our promised rest to our future roles as servant-kings. Rather than perpetuating caricatures of cloud-sitting harp players, I'll show you the vibrant, purposeful existence that awaits believers in Glory.\nThen in our continuing study of Revelation, we dive into chapter six and the opening of the first six seals. We'll examine the Four Horsemen of the Apocalypse and their significance in end-times prophecy, showing how current world events might be setting the stage for these dramatic developments. This chapter begins our transition from Heaven's worship to earth's Tribulation, revealing God's sovereign control over human history.\n#HeavenlyLife #BiblicalHeaven #EndTimes #Revelation6 #FourHorsemen #MarkHitchcock #BibleProphecy #HeavenlyActivities #ChristianHope #EternalLife #PropheticStudy #BibleTeaching #EndTimesProphecy #RevelationStudy #HeavenlyHope #ChristianComfort #BibleExposition #PropheticEvents #HeavenlyPurpose #biblicalteaching \n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/il4neMqbXBg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=il4neMqbXBg",
        "duration": "PT6M33S",
        "published_at": "2025-02-20T12:30:44Z"
    },
    {
        "title": "Trump and Musk: Debunking the Speculation | Marking the End Times",
        "description": "Today I'm addressing a question that keeps flooding my inbox: Is Donald Trump the Antichrist, and is Elon Musk the False Prophet? With Trump's increasing influence in Middle East peace negotiations and Musk's growing technological power, many are drawing parallels to these end-times figures. I'll walk you through six clear biblical reasons why these speculations, while interesting, don't align with the Bible’s description of the Antichrist and False Prophet. From geographical origins to timing of revelation, we'll examine why these popular theories don't hold up under biblical scrutiny.\n\n#BibleProphecy #TrumpProphecy #DonaldTrump #PresidentTrump #ElonMusk #Antichrist #EndTimes #ProphecyTeaching #BiblicalAnalysis #FalseProphet #PropheticStudy #MarkHitchcock #Revelation13 #BibleTeaching #ProphecyUpdate #TrumpMiddleEast #BiblicalProphecy #EndTimesSigns #ProphecyExplanation #MillennialTemple #EternalSecurity #biblequestions \n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/OZzcotHjrk0/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=OZzcotHjrk0",
        "duration": "PT5M18S",
        "published_at": "2025-02-13T12:30:19Z"
    },
    {
        "title": "Breaking the Middle East Time Loops | Marking the End Times",
        "description": "In this episode, we will look at how recent developments in the Middle East mirror the time-loop scenario from the movie Groundhog Day, but with potential for dramatic change. We analyze six major stories involving Iran and Gaza that are reshaping the region's landscape. From Iran's renewed threats and underground missile facilities to President Trump's bold moves regarding Gaza's future, these events carry significant prophetic implications. The announcement of potential U.S. control over Gaza's rebuilding efforts, made alongside Israeli Prime Minister Netanyahu, represents a possible paradigm shift in Middle Eastern dynamics. These developments could either serve as diplomatic leverage or pave the way for Saudi Arabia's normalization with Israel, all while setting the stage for prophesied end-times events.\nIn the subscriber-only portion, we look closer at Revelation 5:8-14, exploring what I call \"When All Heaven Breaks Loose.\" This pivotal passage reveals Heaven's response as Jesus receives the seven-sealed scroll, triggering an unprecedented outburst of praise. We examine three distinct songs of worship and their profound implications for understanding God's throne room and the future kingdom.\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/RK94Q-DJcnc/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=RK94Q-DJcnc",
        "duration": "PT15M2S",
        "published_at": "2025-02-06T13:51:09Z"
    },
    {
        "title": "89 Seconds to Midnight: The Doomsday Clock from God’s Perspective | Marking the End Times",
        "description": "Today I'm examining the latest shift of the Doomsday Clock and what it means from a Bible prophecy perspective. I find it fascinating that secular scientists are now echoing what Scripture has long foretold. We'll explore how recent developments in AI, global conflicts, and biological threats align with biblical predictions, while remembering that our hope isn't in human predictions but in Christ's return.\nFor our subscribers, I also tackle some of your most pressing questions about the Rapture and eternal life. We'll discuss whether graves will physically open during the resurrection, address concerns about salvation and lifestyle choices, explore why we don't see angels delivering messages today like in biblical times, and offer hope to those struggling with depression about their place in Heaven\n--------\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/lILZ1_vsw9k/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=lILZ1_vsw9k",
        "duration": "PT13M33S",
        "published_at": "2025-01-30T12:30:48Z"
    },
    {
        "title": "Trump 2.0 and Bible Prophecy | Marking the End Times",
        "description": "In this episode, I dive deep into the prophetic implications of President Trump's first 48 hours back in office. We examine three crucial developments that align with biblical end-times scenarios: his strong support for Israel, his peace initiatives, and his bold moves in artificial intelligence. While these actions are positive for America and our allies, they could also set the stage for future events prophesied in Scripture. I'll explain how these developments, though beneficial now, could eventually be co-opted by the Antichrist.\nIn our subscriber-only section, we continue our verse-by-verse study of the book of Revelation, focusing on chapter 5:1-7, examining the profound significance of the seven-sealed scroll and the Lamb who is worthy to open it.\n#Mark Hitchcock #BiblicalProphecy #EndTimes #Trump2024 #Israel #PropheticSigns #ArtificialIntelligence #MarkHitchcock #BibleStudy #Revelation #ProphecyUpdate #Christianity #BiblicalPeace #LastDays #PropheticTeaching #BibleProphecy #TrumpIsrael #AbrahamAccords #ChristianPerspective #BibleTeaching #EndTimesProphecy\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/TRL_ukRZIr4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=TRL_ukRZIr4",
        "duration": "PT14M7S",
        "published_at": "2025-01-23T15:55:35Z"
    },
    {
        "title": "Ancient Evidence for a Pre-Trib Rapture | Marking the End Times",
        "description": "Today, I unveil compelling historical evidence that challenges one of the most common objections to the pre-Tribulation Rapture—that it was never taught before 1830. Through examining newly discovered writings from Irenaeus, a second-century church father who learned from those who knew the apostles, we find clear support for a pre-Tribulation Rapture view. Along with subscriber-exclusive answers to crucial questions about salvation, judgment, and end-times prophecy, this teaching provides both historical and biblical evidence for Christ's imminent return.\nIn this episode's Q&A session, I answer questions about core theological issues such as clarifying salvation by grace versus the Judgment Seat of Christ, exploring Isaiah 17's prophecy regarding Damascus and Syria, understanding where raptured Christians will dwell, and whether any unbelievers will survive the Great Tribulation.\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/pghpb8nXzEU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=pghpb8nXzEU",
        "duration": "PT14M29S",
        "published_at": "2025-01-16T12:31:00Z"
    },
    {
        "title": "Setting the Stage for Ezekiel 38 | Marking the End Times",
        "description": "Today, I break down the remarkable geopolitical shifts that could signal movement toward the Gog-Magog war. From Iran's diminishing influence to Turkey's rising power, these are unprecedented changes that align with Bible prophecy. I examine Israel's recent military successes, combined with Iran's vulnerabilities and Turkey's expanding influence in Syria.\n\nIn the subscriber portion, I complete our study of Revelation 4. This includes examining the throne room scene in Heaven, the significance of the 24 elders, the meaning of the four living creatures, the meaning of the \"Holy, holy, holy\" proclamation, the symbolism of the sea of glass, and an analysis of the first hymn of praise in Revelation.\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/OadNG6Ru2bE/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=OadNG6Ru2bE",
        "duration": "PT11M42S",
        "published_at": "2025-01-09T12:30:31Z"
    },
    {
        "title": "The Final Score | Marking the End Times",
        "description": "In this first episode of 2025, I reflect on the powerful message of Psalm 2, which I shared during the Tipping Point Conference in Dallas last year. Titled 'The Final Score,' this teaching explores how all of history is moving towards the ultimate reign of Jesus Christ. As we step into the new year, I emphasize the next event on God's prophetic calendar—the rapture—which could occur at any moment, setting into motion the profound events foretold in Scripture.\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/znPJVEOYa7Y/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=znPJVEOYa7Y",
        "duration": "PT39M26S",
        "published_at": "2025-01-02T12:30:52Z"
    },
    {
        "title": "2025 Prophecy Watch: Critical Developments Ahead | Marking the End Times",
        "description": "In this final episode of Marking the End Times for 2024, I provide a strategic analysis of three major prophetic developments we need to watch in 2025. From the unsettling proliferation of drone swarm technology that could foreshadow Antichrist's future surveillance state, to Israel's increasing strength against its enemies, to Russia's concerning military escalation—we're seeing Bible prophecy align with current events in remarkable ways. I also share exclusive insights into how these developments connect to end-times scenarios predicted in Scripture. While these forecasts may seem concerning, I remind listeners that we face the future with faith, not fear, knowing God remains sovereignly in control as we approach Christ’s return. In the subscriber-only section, we continue our verse-by-verse study of Revelation, focusing on Chapter 4, which I describe as \"the throne chapter of the Bible.\" In this passage, John is transported to Heaven in a vision where he receives the first detailed description of Heaven in the Bible, seeing God seated on His throne surrounded by a rainbow of emerald radiance. This chapter marks a key transition in Revelation, moving from \"the things that are\" (the Church Age) to \"the things that will be,\" giving us a glimpse into God's throne room before the Tribulation events begin to unfold.\n#Prophecy #EndTimes #Israel #Drones #BibleProphecy #MarkHitchcock #PropheticSigns #Russia #Iran #EndTimesProphecy #LastDays #WorldEvents #BiblicalProphecy #ProphecyUpdate #Christianity #Faith #Israel2025 #DroneWarfare #BiblicalPerspective #CurrentEvents #GogMagog #PropheticTimeline #MiddleEast #ChristianPodcast #BibleTeaching #Revelation4\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/m0NrOMv7KZ4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=m0NrOMv7KZ4",
        "duration": "PT14M40S",
        "published_at": "2024-12-26T12:30:51Z"
    },
    {
        "title": "Following the Star: A Biblical Investigation | Marking the End Times",
        "description": "In this special Christmas episode, I explore one of the most fascinating mysteries of the Bible—the Star of Bethlehem. Drawing from Matthew's account, I look at who the Magi really were, their remarkable 800-mile journey, and the various theories about the celestial phenomenon that guided them to Jesus. I examine historical, astronomical, and biblical evidence to understand this divine sign, explaining why I believe it was no ordinary star. It was a supernatural manifestation of God's glory! In this episode, I will also address important questions about the Temple rebuilding, the Gog-Magog war, and practical concerns about communion.\n#BethlehemStar #Christmas #BibleProphecy #Magi #BiblicalArchaeology #ChristmasStar #EndTimes #MarkHitchcock #BibleStudy #ChristianTeaching #Prophecy #WiseMen #BibleHistory #ChristmasMessage #BiblicalTruth #Christianity #PropheticTeaching #JesusBirth #ChristianPodcast #BibleTeaching\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/LZ-Sg7FUKW8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=LZ-Sg7FUKW8",
        "duration": "PT15M22S",
        "published_at": "2024-12-19T12:30:20Z"
    },
    {
        "title": "Syria's Sudden Collapse | Marking the End Times",
        "description": "In this urgent prophetic update, I analyze the sudden fall of Bashar al-Assad's regime in Syria and its dramatic implications for Bible prophecy. I break down how this lightning-fast eight-day offensive has reshaped Middle Eastern alliances, weakening Iran and Russia while strengthening Turkey's position. I also address the frequently misunderstood prophecy of Isaiah 17 regarding Damascus, providing historical context and explaining its true fulfillment. Today’s report will help you understand these complex developments through a biblical lens while examining how these events align with end-times prophecies, particularly the Ezekiel 38 alliance.\n#BibleProphecy #EndTimes #Syria #Damascus #PropheticNews #MarkHitchcock #IsaiahProphecy #MiddleEast #Biblical #Christianity #ProphecyUpdate #EndTimesProphecy #WorldEvents #BibleTeaching #ProphecyTeaching #IsraelNews\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/7RcRiommxFs/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=7RcRiommxFs",
        "duration": "PT20M2S",
        "published_at": "2024-12-12T12:30:05Z"
    },
    {
        "title": "Global Peace Deals-A Sign of What's Coming | Marking the End Times",
        "description": "This week on Marking the End Times, I'll be exploring something truly remarkable happening on the global stage. As we await President Trump's potential return to office, we're witnessing an unprecedented movement toward peace across multiple fronts--from Ukraine to the Middle East. What makes this so prophetically significant is that Bible tells us a time of peace is coming, particularly for Israel, and that this peace will play a crucial role in end-times events.\n\nIn the subscriber portion of the show, I answer questions such as, “Are we going to be here when the US becomes a cashless society and a socialist country?” and “Will God miraculously clean up the earth for the people left to live after the Tribulation?”\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/hjntTWpa1Mk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=hjntTWpa1Mk",
        "duration": "PT13M3S",
        "published_at": "2024-12-05T12:30:39Z"
    },
    {
        "title": "The 6 Life-Changing Benefits of Biblical Hope | Marking the End Times |",
        "description": "In this special Thanksgiving message, I explore the profound difference between worldly optimism and true Biblical hope. As we face increasing darkness in our world - from rising despair to concerning statistics about mental health - I share why Christian hope offers an unshakeable foundation that goes far beyond positive thinking. In the subscriber-only section I cover critical questions about salvation, prophecy, and end times events.\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/MoYgn4oT6UI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=MoYgn4oT6UI",
        "duration": "PT16M30S",
        "published_at": "2024-11-26T12:30:17Z"
    },
    {
        "title": "Nuclear War Predicted in the Bible? | Marking the End Times",
        "description": "Does the Bible mention nuclear weapons in the end times? With Russia's updated nuclear doctrine, Iran approaching nuclear capability, and global tensions rising, this question is more relevant than ever. In this video, I examine three key biblical passages often cited as references to nuclear weapons: Zechariah 14:12, Second Peter 3:10, and Revelation 8.\nI'll explain why these passages, in my view, describe divine judgments rather than human nuclear warfare, while also discussing why nuclear conflict remains a possibility during the tribulation period. With nine nations currently possessing nuclear weapons and Iran at the threshold, understanding this topic is crucial for our times.\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/lY76Eyljeyc/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=lY76Eyljeyc",
        "duration": "PT12M21S",
        "published_at": "2024-11-21T12:30:43Z"
    },
    {
        "title": "Russia’s Secret Weapon…Ezekiel 38 Coming to Life? | Marking the End Times | Marking the End Times",
        "description": "Today on Marking the End Times, I dive into the intensifying Russia-Ukraine War as it approaches its 1,000th day. I’ll break down Russia’s massive counter-offensive featuring 11,000 North Korean troops - the first foreign invasion of Russian soil since WWII. We’ll examine why this escalation is happening now and its potential connection to Trump’s upcoming presidency. Plus, I share insights on how these events align with biblical prophecies, particularly Ezekiel 38's mention of “many peoples.”\nIn our subscriber-only section, we’ll address important questions about the Ten Commandments, Trump’s potential impact on Israel’s peace, and more. Join me as we explore these prophetic developments in light of Scripture.\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/59LbXq4OX8w/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=59LbXq4OX8w",
        "duration": "PT13M7S",
        "published_at": "2024-11-14T12:30:10Z"
    },
    {
        "title": "Trump’s Victory - What It Means for Israel & End Times | Marking the End Times",
        "description": "In this episode of Marking the End Times, I analyze the profound prophetic and geopolitical implications of Trump’s historic election victory. Join me as I break down what this means for Israel, Iran, and the potential for peace in the Middle East through the lens of Biblical prophecy.\nWe’ll explore how the Abraham Accords might be revived under Trump’s presidency and what this could mean for end-times prophecy. I also examine some crucial concerns during the transition period and what it might mean for global stability.\nIn our subscriber-only section, we continue our verse-by-verse study of Revelation, focusing on Jesus’s message to the Church at Sardis - what I call “the Church of the Walking Dead.” We’ll explore vital lessons about maintaining spiritual vitality in these challenging times.\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/gtk96rN4FV4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=gtk96rN4FV4",
        "duration": "PT16M26S",
        "published_at": "2024-11-07T12:30:41Z"
    },
    {
        "title": "Israel's Advance, Iran's Crisis, and America's Crossroads | Marking the End Times",
        "description": "In today's episode, I analyze Israel's remarkable strategic gains against Iran's axis of resistance. We're seeing unprecedented developments: Hezbollah experiencing mass desertions, Hamas suffering major defeats, and Iran facing internal instability. I break down how Israel's recent actions have severely compromised Iran's defenses and what this means for future confrontations.\n\nFor subscribers, I examine the prophetic implications of America's upcoming election through what I call the \"Six I's\" - Iran, Israel, Immigration, Inflation, Immorality, and Infanticide. While America isn't directly mentioned in Bible prophecy, these elections could significantly impact God's prophetic timeline.\n\n--------\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/mW4UcqVuqOs/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=mW4UcqVuqOs",
        "duration": "PT13M15S",
        "published_at": "2024-10-31T11:30:24Z"
    },
    {
        "title": "Russia vs The West: Is This The Biblical End Times Alliance? | Marking the End Times",
        "description": "In this episode, I talk about how Russia’s recent actions align with biblical prophecy. Through the BRICS summit and its deepening alliance with Iran, Putin is deliberately positioning Russia against Western dominance. With Iran supplying thousands of drones and missiles for Russia’s Ukraine campaign, and BRICS now representing nearly half the world’s population, we’re seeing the exact scenario that Ezekiel prophesied 2,500 years ago.\n----\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #prayforisrael",
        "thumbnail": "https://i.ytimg.com/vi/PMvscCtTNUs/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=PMvscCtTNUs",
        "duration": "PT11M58S",
        "published_at": "2024-10-24T11:30:14Z"
    },
    {
        "title": "Iran's Ring of Fire: Biblical Prophecy Unfolding | Marking the End Times",
        "description": "As tensions escalate between Israel and Iran, I examine the prophetic implications of this conflict. Join me as I break down recent developments, including Iran’s proxy buildup and potential US involvement. I’ll also explore how these events could impact the upcoming US elections and set the stage for end-times prophecies.\n\nIn the subscriber portion of the show, I continue our walk through the book of Revelation. I focus on Christ’s message to the compromising church of Pergamum.",
        "thumbnail": "https://i.ytimg.com/vi/2Vug56uVAgM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=2Vug56uVAgM",
        "duration": "PT13M11S",
        "published_at": "2024-10-17T11:30:02Z"
    },
    {
        "title": "Nuclear Iran: The Final Piece in the Prophecy Puzzle? | Marking the End Times",
        "description": "This week on Marking the End Times, I discuss Israel’s impending response to Iran’s recent missile attack. I believe we’re witnessing a critical escalation that could lead to the fulfillment of end-times prophecies, particularly those in Ezekiel 38. I explore potential Israeli targets and the implications of Iran possibly obtaining nuclear weapons. These events underscore the urgency of our times and the need for spiritual preparedness.\nIn the subscriber portion, I address questions about church leadership scandals and the nature of demonic influence on believers. I emphasize the importance of prayer and active involvement in local churches during these challenging times. As always, I encourage viewers to stay rooted in Scripture and focused on Christ as we navigate these prophetic developments.\n\n-----\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit https://EndTimes.com\n\nSubscribers immediately gain access to:\n\n-Extended interviews with experts like Jimmy Evans, Mark Hitchcock, Brian Schrauger, Lee Cummings, Max Lucado and so much more.\n-Detailed breakdowns of prophetic scriptures\n-Regular updates on Middle East developments\n-Exclusive articles and Q&A\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/avAfcI_sP5I/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=avAfcI_sP5I",
        "duration": "PT30M",
        "published_at": "2024-10-10T11:30:01Z"
    },
    {
        "title": "Ballistic Missiles and Biblical Visions...How Will Israel Respond? | Marking the End Times",
        "description": "The recent Iranian missile attack on Israel marks a significant development in Middle East relations. I believe we're seeing prophetic events unfold before our eyes, potentially leading to the fulfillment of Ezekiel 38 and other end-times prophecies.\n\nIn these turbulent times, I encourage believers to stay vigilant and faithful, just like the persecuted church of Smyrna in Revelation. We may face increasing opposition in our culture, but we must remember that God is sovereign over all events. He knows our struggles and promises eternal rewards for those who remain faithful.\n\nAs we observe these world events, it's crucial to study Scripture, understand the times, and be prepared for Christ's return\n\n---\nJoin me as we unpack these urgent issues and their significance in God’s prophetic timeline. Understanding these signs isn’t just about predicting the future—it’s about living with purpose today. Let’s mark the end times together!\n\nFor Full Episodes and Exclusive content, head over to endtimes.com and sign up for free!\n\n\n#EndTimesProphecy #GlobalCensorship #BiblicalPerspective",
        "thumbnail": "https://i.ytimg.com/vi/0ni79hHmYzM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=0ni79hHmYzM",
        "duration": "PT14M38S",
        "published_at": "2024-10-03T11:30:01Z"
    },
    {
        "title": "The Next Phase of War | Marking the End Times",
        "description": "In this episode I dive into the escalating conflict between Israel and Hezbollah. I analyze recent developments, including Israel’s preparation for a potential ground invasion of Lebanon and Hezbollah’s unprecedented missile attack on Tel Aviv. I also discuss China’s recent launch of an intercontinental ballistic missile into the Pacific, examining its timing and implications. Join me as I explore these events through both geopolitical and prophetic lenses, offering insights on how they might relate to biblical end-times prophecies.\n\n----\nJoin me as we unpack these urgent issues and their significance in God’s prophetic timeline. Understanding these signs isn’t just about predicting the future—it’s about living with purpose today. Let’s mark the end times together!\n\nFor Full Episodes and Exclusive content, head over to endtimes.com and sign up for free!\n\n\n#EndTimesProphecy #GlobalCensorship #BiblicalPerspective",
        "thumbnail": "https://i.ytimg.com/vi/RdSPruAm9bA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=RdSPruAm9bA",
        "duration": "PT13M41S",
        "published_at": "2024-09-26T11:30:19Z"
    },
    {
        "title": "Exploding Pagers: A Prelude to Biblical Prophecy? | Marking the End Times",
        "description": "In this week’s episode of Marking the End Times, I’m diving into a shocking event that took over global headlines: the explosion of pagers across Lebanon and Syria, targeting Hezbollah fighters and leaders. If you haven’t heard, these attacks have already left 12 dead and thousands wounded.\n\nI’m going to break down:\n\nWhat happened? Why now?\n\nThe geopolitical and prophetic impact of this attack.\nCould this be the beginning of the Northern War many have predicted, or even escalate into a larger regional conflict?\n\n\nIt seems Israel, possibly through Mossad, managed to sabotage 5,000 pagers used by Hezbollah for communication, leading to this unprecedented attack. As the situation unfolds, handheld radios are now exploding too, which only raises more questions: Is the Middle East on the verge of war?\n\n\n----\nJoin me as we unpack these urgent issues and their significance in God’s prophetic timeline. Understanding these signs isn’t just about predicting the future—it’s about living with purpose today. Let’s mark the end times together!\n\nFor Full Episodes and Exclusive content, head over to endtimes.com and sign up for free!\n\n\n#EndTimesProphecy #GlobalCensorship #BiblicalPerspective",
        "thumbnail": "https://i.ytimg.com/vi/YH_oTO3fRMY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=YH_oTO3fRMY",
        "duration": "PT12M32S",
        "published_at": "2024-09-19T11:30:30Z"
    },
    {
        "title": "Is the Gog-Magog Alliance Complete? | Marking the End Times",
        "description": "In this episode, we dive into the growing alliance between Turkey, Iran, and Russia, exploring how recent events align with biblical end times prophecies. Is President Erdogan leading an Islamic offensive against Israel? Are we witnessing the beginning stages of the Gog and Magog war? \n\nJoin me as we unpack these urgent issues and their significance in God’s prophetic timeline. Understanding these signs isn’t just about predicting the future—it’s about living with purpose today. Let’s mark the end times together!\n\nFor Full Episodes and Exclusive content, head over to endtimes.com and sign up for free!\n\n\n#EndTimesProphecy #GlobalCensorship #BiblicalPerspective",
        "thumbnail": "https://i.ytimg.com/vi/2Ej0IJWrzzY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=2Ej0IJWrzzY",
        "duration": "PT14M41S",
        "published_at": "2024-09-12T11:30:01Z"
    },
    {
        "title": "How Close Are We To The Tribulation? | Marking the End Times",
        "description": "In this episode, I examine how these events align with biblical prophecy, particularly the peace treaty that will usher in the tribulation period. Join me as we explore the connections between current headlines and end-times prophecies, and discover why the world stage is primed for the Antichrist’s appearance. Don’t miss this timely analysis of unfolding events in light of God’s Word.\n\nJoin me as we unpack these urgent issues and their significance in God’s prophetic timeline. Understanding these signs isn’t just about predicting the future—it’s about living with purpose today. Let’s mark the end times together!\n\nFor Full Episodes and Exclusive content, head over to endtimes.com and sign up for free!\n\n\n#EndTimesProphecy #GlobalCensorship #BiblicalPerspective",
        "thumbnail": "https://i.ytimg.com/vi/h83RdmzKFYg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=h83RdmzKFYg",
        "duration": "PT13M14S",
        "published_at": "2024-09-05T11:30:31Z"
    },
    {
        "title": "Are We Entering the Antichrist Era? How Censorship Signals the End Times | Marking The End Times",
        "description": "In this episode of Marking the End Times, I explore the shocking rise of global censorship and its connection to biblical prophecy. We’ll examine recent events, including arrests and apologies from tech giants, and how governments worldwide are restricting free speech. I’ll break down how these developments align with Daniel’s vision of the revived Roman Empire and the coming Antichrist.\n\nJoin me as we unpack these urgent issues and their significance in God’s prophetic timeline. Understanding these signs isn’t just about predicting the future—it’s about living with purpose today. Let’s mark the end times together!\n\nFor Full Episodes and Exclusive content, head over to endtimes.com and sign up for free!\n\n#EndTimesProphecy #GlobalCensorship #BiblicalPerspective",
        "thumbnail": "https://i.ytimg.com/vi/Bxah_J7zRKE/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Bxah_J7zRKE",
        "duration": "PT13M42S",
        "published_at": "2024-08-29T11:30:10Z"
    },
    {
        "title": "7 Enemies of Israel & Reaction to the Glorified Christ | Marking The End Times",
        "description": "This week on Marking the End Times, I want to break down the 7 enemies of Israel. Israel is in the middle of a 7 front war and I list each of their enemies and explain their threat. I also explain how this points to bible prophecy and the future tribulation period.\n\nFor exclusive content and in-depth analysis on end-times prophecy and current events, visit www.endtimes.com.\n\nGain instant access to:\n\nExtended interviews with experts like Jimmy Evans & Brian Schrauger\nDetailed breakdowns of prophetic scriptures\nRegular updates on Middle East developments\nExclusive webinars and Q&A sessions\n\nDon't miss out on critical insights that could shape our understanding of these pivotal times. Subscribe to our channel and visit endtimes.com today to stay informed and prepared.\n#IsraelConflict #EndTimesProphecy #MiddleEastCrisis #PrayForIsrael",
        "thumbnail": "https://i.ytimg.com/vi/B8RP7MFsVag/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=B8RP7MFsVag",
        "duration": "PT14M8S",
        "published_at": "2024-08-22T11:30:09Z"
    },
    {
        "title": "Unexpected Developments in End Times Prophecy | Marking The End Times",
        "description": "Join me, as we explore the latest developments in the Middle East and their potential prophetic significance. In this episode of Marking the End Times:\n\nAnalyze the growing tensions between Israel, Iran, and Hezbollah\nDiscuss the recent earthquake in Syria and its surprising impact on regional dynamics\nExamine how current events align with biblical prophecy\nReflect on God's sovereignty in world affairs",
        "thumbnail": "https://i.ytimg.com/vi/yvmzT-eABQI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=yvmzT-eABQI",
        "duration": "PT13M51S",
        "published_at": "2024-08-15T11:30:34Z"
    },
    {
        "title": "Iran's Retaliation & Countdown to Conflict | Marking The End Times",
        "description": "As a Bible prophecy expert, I'm watching the Middle East with great concern. Israel's recent actions have put Iran on edge, and we're bracing for potential retaliation. The alliances forming - Iran, Russia, and Turkey on one side, Western nations on the other - mirror end-times prophecies. While these events are alarming, they also signal we're drawing closer to Christ's return. As we pray for peace, we must stay informed and grounded in Scripture, looking to these developments as signs of the times.\n\n-----\n\n**For the subscriber portion & Full Episodes, head over to endtimes.com and sign up for a free trial**",
        "thumbnail": "https://i.ytimg.com/vi/EOPqq0kCAzM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=EOPqq0kCAzM",
        "duration": "PT12M18S",
        "published_at": "2024-08-08T11:30:12Z"
    },
    {
        "title": "Prophetic Pieces Falling Into Place | Marking The End Times",
        "description": "In today's episode I explore the escalating Middle East tensions, focusing on the threat of war between Israel and Hezbollah, and Turkey's shocking threats against Israel. I'll show how these events align with biblical prophecies, especially the Gog-Magog war in Ezekiel 38. In our subscriber section, we'll tackle thought-provoking questions about God's protection, the 12th apostle's identity, and Adam and Eve's eternal fate. Join me as we examine current events through the lens of prophecy and deepen our understanding of God's end-times plan. \n\nSubscribe at endtimes.com for full access to our Q&A and more in-depth analysis!\n\n👉 Subscribe for weekly prophecy insights!\n🌐 Visit our website: endtimes.com\n\n#EndTimesProphecy #IsraelConflict #BiblicalProphecy #Ezekiel38 #MarkHitchcock\"\nThis description incorporates keywords, a brief content summary, timestamps, a call-to-action, hashtags, and links, all of which can help with SEO and viewer engagement.",
        "thumbnail": "https://i.ytimg.com/vi/izdf5GcSM1Y/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=izdf5GcSM1Y",
        "duration": "PT12M32S",
        "published_at": "2024-08-01T11:30:31Z"
    },
    {
        "title": "CHRISTIAN RAW REACTION To Olympic Opening Ceremony",
        "description": "Christian raw reaction to dark & demonic Olympic opening ceremony that included a drag rendition of the Lord's Supper.",
        "thumbnail": "https://i.ytimg.com/vi/LVwsk3aqYDI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=LVwsk3aqYDI",
        "duration": "PT7M20S",
        "published_at": "2024-07-27T22:00:17Z"
    },
    {
        "title": "It's NOT What You Think | Marking the End Times",
        "description": "In this week’s video, we delve into China’s escalating aggression on the world stage and its potential role in biblical end times prophecy. We examine recent Chinese military activities, from joint exercises with Russia to naval presence near Alaska, and discuss how these developments align with scriptural predictions about the “kings of the east.”\n\n\nTake your studies to the next level. Enjoy traditional 10% off of various Logos 10 Academic packages + 5 free digital books!\nhttps://partner.logosbible.com/click....",
        "thumbnail": "https://i.ytimg.com/vi/NY_nRn37nk8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=NY_nRn37nk8",
        "duration": "PT12M48S",
        "published_at": "2024-07-25T11:30:12Z"
    },
    {
        "title": "Beyond Coincidence? The Spiritual Implications of Trump's Near-Miss | Marking the End Times",
        "description": "I believe the recent assassination attempt on President Trump was a clear demonstration of God's providential hand. Just as God guided an arrow to fulfill His purpose in ancient times, He guided a bullet to preserve Trump's life. This event serves as a powerful reminder of God's sovereignty over nations and leaders, and it could be a turning point for both Trump and our country. We must recognize these divine interventions and respond with prayer, humility, and a renewed commitment to our faith.\n\nTo watch full episodes of Tipping Point, visit https://EndTimes.com\n\nTake your studies to the next level. Enjoy traditional 10% off of various Logos 10 Academic packages + 5 free digital books!\nhttps://partner.logosbible.com/click....",
        "thumbnail": "https://i.ytimg.com/vi/-kesdGYt83Y/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=-kesdGYt83Y",
        "duration": "PT13M45S",
        "published_at": "2024-07-18T11:00:01Z"
    },
    {
        "title": "Tensions Rising | Israel’s Fight on Multiple Fronts | Marking The End Times with Bill Koenig",
        "description": "As a pastor and end-times scholar, I had the privilege of interviewing Bill Koenig, a respected journalist and White House correspondent. Bill shared invaluable insights from his recent trip to Israel and a significant event at The Hague. He provided a firsthand account of the tense situation in Israel, particularly regarding the threats from Hezbollah. Bill also detailed a crucial gathering at The Hague where Christian leaders presented biblical and legal arguments supporting Israel’s right to disputed territories. We discussed the surge of anti-Semitism in America and the concerning political landscape, including the Biden administration’s stance on Israel. Bill’s unique perspective on these issues, combining geopolitical analysis with biblical prophecy, offers our audience a deeper understanding of current events in light of end-times scripture.\n\n\nTo watch full episodes of Tipping Point, visit https://EndTimes.com\n\nTake your studies to the next level. Enjoy traditional 10% off of various Logos 10 Academic packages + 5 free digital books!\nhttps://partner.logosbible.com/click.track?CID=466788&AFID=564395",
        "thumbnail": "https://i.ytimg.com/vi/6FWNqhZsvq8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=6FWNqhZsvq8",
        "duration": "PT13M51S",
        "published_at": "2024-07-11T11:00:06Z"
    },
    {
        "title": "3 Reasons America is NOT in Bible Prophecy | Marking the End Times",
        "description": "In this episode of \"Marking the End Times,\" I'm celebrating America's birthday by sharing my view on America's role in the End Times. This is a question we get asked most often at Endtimes.com, and today I'm sharing three reasons I believe America will not be around in the time of the rapture. \n\nTo watch more full episodes of Tipping Point, visit https://EndTimes.com\n--\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395\n\nYou don’t have to be in seminary to enjoy these incredible deals. We’ve got up to 60% off books and courses for every student of the Bible. From biblical languages to theology and more, find what you need to take your study to the next level.\n\nKeep your seminary skills fresh with 24% off a Logos 10 package to take into your next chapter.\n\nCompare packages to find what’s right for you, and use code GRAD24 at checkout for your special discount. Con-grad-ulations! We’ll see ourselves out.",
        "thumbnail": "https://i.ytimg.com/vi/gDWT3D8S4j0/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=gDWT3D8S4j0",
        "duration": "PT15M34S",
        "published_at": "2024-07-04T13:21:37Z"
    },
    {
        "title": "World Powers in Prophecy: The G10 and the End Times | Marking the End Times",
        "description": "In this episode of \"Marking the End Times,\" I dive into the fascinating world of global alliances and their potential connection to biblical prophecy. Join me as I explore the significance of various \"G\" groups like the G7 and G20, and how they might be paving the way for the prophetic G10 mentioned in Scripture. I'll break down key passages from Daniel and Revelation, offering insights into how current world events could be setting the stage for the rise of the Antichrist. Whether you're a prophecy enthusiast or just curious about end times events, this episode will give you a lot to think about. Don't forget to subscribe for more biblical insights on current events!\n\nTo watch more full episodes of Tipping Point, visit https://EndTimes.com\n\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395\n\nYou don’t have to be in seminary to enjoy these incredible deals. We’ve got up to 60% off books and courses for every student of the Bible. From biblical languages to theology and more, find what you need to take your study to the next level.\n\nKeep your seminary skills fresh with 24% off a Logos 10 package to take into your next chapter.\n\nCompare packages to find what’s right for you, and use code GRAD24 at checkout for your special discount. Con-grad-ulations! We’ll see ourselves out.",
        "thumbnail": "https://i.ytimg.com/vi/6-VYntldIRU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=6-VYntldIRU",
        "duration": "PT13M47S",
        "published_at": "2024-06-27T11:00:05Z"
    },
    {
        "title": "The Biblical Dominoes Are Falling: Gog, Magog & the Armageddon | Marking The End Times",
        "description": "In this hard-hitting video, I unpack the alarming convergence of current events that point toward the biblically prophesied Gog and Magog war against Israel. From Turkey pivoting toward Russia and Iran, to Iran's frightening nuclear progress, to the looming war between Israel and Hezbollah - the stage is being set for this cataclysmic invasion. I also answer crucial questions about the Bible's divine origin, signs preceding Jesus' first coming, recognizing God's voice, and whether Catholics can be saved. With time growing short before Christ's return, this is a must-watch wake-up call to get right with God. Don't miss this urgent prophetic update!\n\nTo watch more full episodes of Tipping Point, visit https://EndTimes.com\n\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395\n\nYou don’t have to be in seminary to enjoy these incredible deals. We’ve got up to 60% off books and courses for every student of the Bible. From biblical languages to theology and more, find what you need to take your study to the next level.\n\nKeep your seminary skills fresh with 24% off a Logos 10 package to take into your next chapter.\n\nCompare packages to find what’s right for you, and use code GRAD24 at checkout for your special discount. Con-grad-ulations! We’ll see ourselves out.",
        "thumbnail": "https://i.ytimg.com/vi/jbi3WIO2BR0/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=jbi3WIO2BR0",
        "duration": "PT13M48S",
        "published_at": "2024-06-20T11:00:42Z"
    },
    {
        "title": "The 7 Lead-Ups to The Ultimate Event | Marking The End Times",
        "description": "As someone who studies biblical prophecy, I have found that there are actually seven rapture events described in Scripture - three in the Old Testament and four in the New Testament. These previous raptures of individuals like Enoch, Elijah, Philip, and even Jesus himself foreshadow and help shed light on the final, corporate rapture of the church that is still to come.\nBy examining how these past raptures were literal, physical, and instantaneous events of people being taken from earth to heaven, we can see that the future rapture of believers will be just as real and sudden. While there are mysteries around why we still need to share the gospel if names are written in the Book of Life, these rapture accounts confirm that Satan's ultimate defeat is sure as more souls are rescued from his kingdom.\n\n\nTo watch full episodes of Tipping Point, visit https://EndTimes.com\n\nYou don’t have to be in seminary to enjoy these incredible deals. We’ve got up to 60% off books and courses for every student of the Bible. From biblical languages to theology and more, find what you need to take your study to the next level.\n\nKeep your seminary skills fresh with 24% off a Logos 10 package to take into your next chapter.\n\nCompare packages to find what’s right for you, and use code GRAD24 at checkout for your special discount. Con-grad-ulations! We’ll see ourselves out.\n\nhttps://partner.logosbible.com/click....",
        "thumbnail": "https://i.ytimg.com/vi/Ew9pm-3vZTs/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Ew9pm-3vZTs",
        "duration": "PT14M32S",
        "published_at": "2024-06-13T11:00:11Z"
    },
    {
        "title": "Biblical Birth Pangs & The Coming Northern Front | Marking The End Times",
        "description": "I’m Mark Hitchcock, a pastor and Bible prophecy expert. I’ve just returned from a two-week “Journeys of Paul” trip to Greece and Turkey, where I visited historic sites like Ephesus. Now, I’m deeply concerned about the escalating tensions between Israel and Hezbollah. I believe we’re on the brink of what could be the third Lebanon War, with Israel facing threats from multiple fronts—Hamas, Hezbollah, Iran-backed groups in Iraq, and the Houthis in Yemen.\nAs someone who’s studied Bible prophecy for years, I see these events as setting the stage for the end-times scenarios described in Ezekiel 38-39, particularly the Gog and Magog war. Iran’s central role and its network of proxy groups align closely with these prophecies. While we’re seeing a preview of these events now, I believe the true “birth pangs” Jesus spoke of in Matthew 24 will occur during the tribulation period, culminating in His second coming. In these uncertain times, I urge you to pray for the peace of Jerusalem and to examine your own faith, ensuring it’s genuine and not just a profession.\n\nTo watch full episodes of Tipping Point, visit https://EndTimes.com\n\nYou don’t have to be in seminary to enjoy these incredible deals. We’ve got up to 60% off books and courses for every student of the Bible. From biblical languages to theology and more, find what you need to take your study to the next level.\n\nKeep your seminary skills fresh with 24% off a Logos 10 package to take into your next chapter.\n\nCompare packages to find what’s right for you, and use code GRAD24 at checkout for your special discount. Con-grad-ulations! We’ll see ourselves out.\n\nhttps://partner.logosbible.com/click....",
        "thumbnail": "https://i.ytimg.com/vi/0fqzWAcOlvA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=0fqzWAcOlvA",
        "duration": "PT12M34S",
        "published_at": "2024-06-06T11:00:01Z"
    },
    {
        "title": "The Origin of Revelation: Unraveling Mysteries on Patmos | Marking the End Times",
        "description": "Standing on the hallowed ground of Patmos, where John received the visions of Revelation, filled me with reverence. Seeing those prophetic images come to life on the island stirred an intense longing for Christ's unveiling and eternal reign. I urged our group to eagerly await and prepare for that glorious day when the Alpha and Omega makes all things new.",
        "thumbnail": "https://i.ytimg.com/vi/qEyc38c8vPg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=qEyc38c8vPg",
        "duration": "PT10M14S",
        "published_at": "2024-05-30T17:30:09Z"
    },
    {
        "title": "When the Bible Wrote the Future | Marking the End Times",
        "description": "As a pastor teaching the truth of God's Word, I'm amazed to be standing here in ancient Macedonia near the burial site of Philip II and the birthplace of his son Alexander the Great. The prophecies in the book of Daniel, written centuries beforehand, provide such specific details about the rise and conquests of Alexander's Greek Empire that were stunningly fulfilled. This is powerful evidence that the Bible's other prophecies about events still to come, like the return of Christ, will just as accurately be realized according to God's perfect timing and plan. Seeing these prophecies play out gives me great confidence to keep proclaiming God's sure Word.",
        "thumbnail": "https://i.ytimg.com/vi/T5NJZHBGSIk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=T5NJZHBGSIk",
        "duration": "PT13M21S",
        "published_at": "2024-05-23T11:00:23Z"
    },
    {
        "title": "The Coming Clash: Israel, Iran and Ezekiel’s War",
        "description": "On this milestone Marking the End Times episode, I’m joined by prophecy expert Jan Markell. We discuss the escalating threats to Israel from Iran and its proxies, tying current events to Ezekiel’s prophecy. With anti-Semitism on the rise and the world craving a leader, we explore God’s prophetic plan unfolding before our eyes.\n\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395\n\nYou don’t have to be in seminary to enjoy these incredible deals. We’ve got up to 60% off books and courses for every student of the Bible. From biblical languages to theology and more, find what you need to take your study to the next level.\n\nKeep your seminary skills fresh with 24% off a Logos 10 package to take into your next chapter.\n\nCompare packages to find what’s right for you, and use code GRAD24 at checkout for your special discount. Con-grad-ulations! We’ll see ourselves out.\n\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395",
        "thumbnail": "https://i.ytimg.com/vi/W6IultZKNcg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=W6IultZKNcg",
        "duration": "PT11M55S",
        "published_at": "2024-05-16T11:00:24Z"
    },
    {
        "title": "Pandemic Fears and End Times Plagues | Marking The End Times with Mark Hitchcock",
        "description": "I’m deeply concerned about the rising fears of a potential bird flu pandemic caused by the H5N1 strain. This deadly virus is spreading rapidly among animals and has even been found in commercial milk samples in the US. While unsettling, this reminds me of Jesus’ prophecies about plagues and pestilences escalating in the end times, foreshadowing worse to come.\n\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395\n\nYou don’t have to be in seminary to enjoy these incredible deals. We’ve got up to 60% off books and courses for every student of the Bible. From biblical languages to theology and more, find what you need to take your study to the next level.\n\nKeep your seminary skills fresh with 24% off a Logos 10 package to take into your next chapter.\n\nCompare packages to find what’s right for you, and use code GRAD24 at checkout for your special discount. Con-grad-ulations! We’ll see ourselves out.\n\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395",
        "thumbnail": "https://i.ytimg.com/vi/gFfKaRmhqUI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=gFfKaRmhqUI",
        "duration": "PT11M55S",
        "published_at": "2024-05-09T11:00:28Z"
    },
    {
        "title": "Will Anti-Israel Wave Trigger the Rapture? | Marking the End Times",
        "description": "In this video, I discuss the alarming rise of anti-Semitism on U.S. college campuses and how the younger generations' negativity towards Israel could signal America turning against the Jewish state. I explain why I believe America must remain pro-Israel until the rapture occurs, and how the rapture may precipitate America's decline and withdrawal of support for Israel - a key sign of the end times. I also answer subscriber questions about missing the rapture due to sin, the sheep and goats judgment, and recognizing people in heaven. I provide an overview of my new book \"AI & the Antichrist\" co-authored with Jimmy Evans about the Antichrist's coming global control enabled by modern technology.\n\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395\n\nYou don’t have to be in seminary to enjoy these incredible deals. We’ve got up to 60% off books and courses for every student of the Bible. From biblical languages to theology and more, find what you need to take your study to the next level.\n\nKeep your seminary skills fresh with 24% off a Logos 10 package to take into your next chapter.\n\nCompare packages to find what’s right for you, and use code GRAD24 at checkout for your special discount. Con-grad-ulations! We’ll see ourselves out.\n\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395",
        "thumbnail": "https://i.ytimg.com/vi/YSkMxfakCWA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=YSkMxfakCWA",
        "duration": "PT12M27S",
        "published_at": "2024-05-02T11:00:33Z"
    },
    {
        "title": "Russia’s Rage and Coming Invasion of Israel | Marking The End Times",
        "description": "This week on 'Marking the End Times,' I want to focus on Russia. Pressure is continuing to build as Russia ramps up its ties with Iran and aligns more closely with Hamas. These developments could lead to the invasion of Israel, as predicted in Ezekiel chapters 38 and 39, which I believe will occur after the rapture of the church.\n\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395\n\nYou don’t have to be in seminary to enjoy these incredible deals. We’ve got up to 60% off books and courses for every student of the Bible. From biblical languages to theology and more, find what you need to take your study to the next level.\n\nKeep your seminary skills fresh with 24% off a Logos 10 package to take into your next chapter.\n\nCompare packages to find what’s right for you, and use code GRAD24 at checkout for your special discount. Con-grad-ulations! We’ll see ourselves out.\n\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395",
        "thumbnail": "https://i.ytimg.com/vi/uHl4wFbW8Yo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=uHl4wFbW8Yo",
        "duration": "PT11M48S",
        "published_at": "2024-04-25T11:00:56Z"
    },
    {
        "title": "The Surprising Arab Alliance and Coming Middle East Peace | Marking The End Times",
        "description": "--------\n\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395\n\nYou don’t have to be in seminary to enjoy these incredible deals. We’ve got up to 60% off books and courses for every student of the Bible. From biblical languages to theology and more, find what you need to take your study to the next level.\n\nKeep your seminary skills fresh with 24% off a Logos 10 package to take into your next chapter.\n\nCompare packages to find what’s right for you, and use code GRAD24 at checkout for your special discount. Con-grad-ulations! We’ll see ourselves out.\n\nhttps://partner.logosbible.com/click.track?CID=468575&AFID=564395",
        "thumbnail": "https://i.ytimg.com/vi/8s3x4cIB6Pk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=8s3x4cIB6Pk",
        "duration": "PT12M18S",
        "published_at": "2024-04-18T11:00:13Z"
    },
    {
        "title": "Israel Braces For Retaliation After Airstrike | Marking The End Times",
        "description": "Watch the Full Episode at www.endtimes.com\n\nIsrael is on high alert as tensions escalate with Iran after an Israeli airstrike killed Iranian officials in Syria. Iran has vowed revenge, threatening potential drone/missile strikes on Israel or its facilities abroad.\n\nOver on our subscriber-only portion, Mark covers subscriber Q&A on topics like the Mark of the Beast, dealing with doubts about salvation, future technology after the Tribulation, the location of the Garden of Eden, and whether the Ezekiel 38 war could be World War III.",
        "thumbnail": "https://i.ytimg.com/vi/vYmC0625-AQ/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=vYmC0625-AQ",
        "duration": "PT13M46S",
        "published_at": "2024-04-11T11:00:51Z"
    },
    {
        "title": "No More Christian Values.. The Spirit Of Antichrist In The U.S | Israel Update",
        "description": "On Easter 2024, the Biden administration highlighted Transgender Visibility Day, juxtaposing it with Christianity's holiest day. Bible teacher Mark Hitchcock sees these events foreshadowing end times prophecy about the anti-Christ removing every vestige of God from society. Hitchcock explores the unprecedented overhaul adding LGBTQ commemorations to calendars while reducing religious holidays. He provides biblical insights on how today's cultural shifts point toward the spirit of the anti-Christ and Christ's soon return.",
        "thumbnail": "https://i.ytimg.com/vi/FNCsuDI8L7s/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=FNCsuDI8L7s",
        "duration": "PT12M15S",
        "published_at": "2024-04-04T11:00:19Z"
    },
    {
        "title": "America Turns Its Back on Israel: Judgment Looming?",
        "description": "For full episodes, visit endtimes.com !\n\nThis week on Marking the End Times, I explain the expanding divide between the US and Israel. I'll be discussing three significant events that have contributed to this rift, as well as explore a possible link to the collapse of the Francis Scott Key Bridge in Baltimore, and examining America's dwindling support for Israel.\nI'll also address questions such as, \"How can we be nearing the Rapture if Israel is constructing walls?\" and \"What is the significance of the silence in Heaven described in Revelation 8:1?\"\n\n#EndTimes #IsraelUSRelations #BibleProphecy #FrancisScottKeyBridge\nIn the Q&A: Insights on the Gog/Magog war, the restrainer’s identity, and the silence in heaven in Revelation. #GogMagog #Restrainer #Revelation8 #SubscriberQA",
        "thumbnail": "https://i.ytimg.com/vi/f2zpk9L48eI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=f2zpk9L48eI",
        "duration": "PT13M14S",
        "published_at": "2024-03-28T11:00:39Z"
    },
    {
        "title": "Famines, Wars and the Antichrist: Signs of the End Times Unfolding | Marking The End Times",
        "description": "For the full show, head over to www.endtimes.com\nAre we witnessing the foreshadowing of the black horse of Revelation 6? In this video, we discuss Europe's growing anxiety over potential food shortages and how it parallels biblical prophecies about famine and hyperinflation during the end times.\n\nWe also answer subscriber questions about sin during the Millennium, Matthew's name change, and the striking fulfillment of ancient prophecies concerning the decline of Egypt as \"the lowest of kingdoms\" - a reality we witnessed firsthand during our recent trip there.\n\nDon't miss this insightful exploration of current events aligning with scripture's warnings about the Four Horsemen of the Apocalypse. #Revelation #Endtimes #Prophecy #Famine #FoodShortages #FourHorsemen #ThirdSeal #BlackHorse #Egypt #MillennialReign #BibleProphecy #Eschatology #CurrentEvents #SignsoftheTimes",
        "thumbnail": "https://i.ytimg.com/vi/RdxzM46CPqk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=RdxzM46CPqk",
        "duration": "PT12M29S",
        "published_at": "2024-03-21T11:00:19Z"
    },
    {
        "title": "Iran's Shadow Over The Middle East & Sharm el-Sheikh | Marking The End Times",
        "description": "Today, I’m exploring Sharm el-Sheikh’s pivotal role in the 1967 Six-Day War and its connection to Iran’s growing influence in the region today. This is a profound look at how past events and present realities align with biblical prophecy.\n#SharmElSheikh #SixDayWar #Iran #MiddleEast #Prophecy #EndTimes #BibleProphecy #Israel #Hamas #HouthiRebels #RedSea",
        "thumbnail": "https://i.ytimg.com/vi/axXQaJMecWg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=axXQaJMecWg",
        "duration": "PT7M55S",
        "published_at": "2024-03-14T11:00:06Z"
    },
    {
        "title": "This Explosive Bible Discovery Was Hiding in Egypt All Along | Marking the End Times",
        "description": "This week on Marking the End Times, I am teaching from the Nile River as I am on a Trip with Dallas Theological Seminary. During our time, I want to make the connection between an ancient battle and the final battle of Armageddon.\n\n#Armageddon #Megiddo #AncientHistory #Archaeology #Egypt #Prophecy #EndTimes #BibleHistory #AncientBattles #Karnak #Luxor #NileRiver #TutmoseIII #Pharaohs #KarnakTemple #BibleProphecy #Hieroglyphs #AncientEgypt",
        "thumbnail": "https://i.ytimg.com/vi/d0wlsBg8_Pc/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=d0wlsBg8_Pc",
        "duration": "PT11M",
        "published_at": "2024-03-07T12:00:36Z"
    },
    {
        "title": "Decoding Putin and Biblical Prophecy | Marking The End Times",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/Ouvouf995J4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Ouvouf995J4",
        "duration": "PT13M24S",
        "published_at": "2024-02-29T12:00:31Z"
    },
    {
        "title": "Middle East Peace Push: Prelude to the Antichrist? | Marking The End Times",
        "description": "The world is frantically pursuing Middle East peace like never before. But could this global diplomacy actually be setting the stage for the rise of the Antichrist?\n\nIn this eye-opening video, Bible prophecy expert Mark Hitchcock exposes the startling connections between the latest developments in the Israel-Hamas conflict and what Scripture foretold over 2,500 years ago.",
        "thumbnail": "https://i.ytimg.com/vi/9mYL_4_t0rI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=9mYL_4_t0rI",
        "duration": "PT13M53S",
        "published_at": "2024-02-22T12:00:07Z"
    },
    {
        "title": "Red Heifer, Heavenly Warfare, Russia and Coming Attacks on Jerusalem | Marking The End Times",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/QxBKtQMZISA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=QxBKtQMZISA",
        "duration": "PT13M3S",
        "published_at": "2024-02-15T12:00:31Z"
    },
    {
        "title": "Zionism Explained | Israel's Claim To The Holy Land | Marking the End Times",
        "description": "This week on Marking the End Times, I want to dive into the topic of Zionism. I'll explain the origins of Zionism, outline the differences between Christian Zionism, and discuss how Hamas and Iran are leveraging Zionism to their advantage.\n\nI'll also be answering some questions from our subscribers, such as, \"Should we expect to see the Gog & Magog war before the rapture?\" and \"Where are Enoch and Elijah now?\"",
        "thumbnail": "https://i.ytimg.com/vi/-qtQD4N9xPU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=-qtQD4N9xPU",
        "duration": "PT15M36S",
        "published_at": "2024-02-08T12:00:01Z"
    },
    {
        "title": "Rising Tensions Point To An Imminent Attack | Marking The End Times",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/BIHzRSxDXCI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=BIHzRSxDXCI",
        "duration": "PT12M52S",
        "published_at": "2024-02-01T12:00:09Z"
    },
    {
        "title": "Doomsday Clock Nearing Midnight | Marking the End Times",
        "description": "This week on Marking the End Times, I want to discuss the Doomsday Clock. The Doomdsday Clock is set at 90 seconds to midnight, the closest it has ever been. I want to take this time to explain why its set at 90 seconds and what that means biblically.\nIn the subscriber portion of the show, I answer questions such as, “Will my kids have an opportunity to turn back to their faith?” and “Will people who oget saved during the tribulation have the Holy Spirit?”",
        "thumbnail": "https://i.ytimg.com/vi/sdaljCSz7A4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=sdaljCSz7A4",
        "duration": "PT11M36S",
        "published_at": "2024-01-25T12:00:48Z"
    },
    {
        "title": "Wars & Rumors of Wars Global Tensions Hint At Last Days",
        "description": "This week on Marking the End Times, I discuss Matthew 24 where Jesus prophesies about wars and rumors of wars. I want to inform you of many conflicts happening around the world as it pertains to bible prophecy and the wars that were rumored by Jesus.",
        "thumbnail": "https://i.ytimg.com/vi/3v0T2opOZVc/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=3v0T2opOZVc",
        "duration": "PT13M27S",
        "published_at": "2024-01-18T12:00:02Z"
    },
    {
        "title": "War, Red Sea Chaos & Houthis' Escalation | Marking The End Times",
        "description": "This week on Marking the End Times, I want to discuss the Houthis and their threat upon Israel. I take the time to explain the Houthis, their movement and ideology, recent attacks and more.\n\nWatch full episodes over at www.endtimes.com",
        "thumbnail": "https://i.ytimg.com/vi/8_9s63NLgus/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=8_9s63NLgus",
        "duration": "PT13M22S",
        "published_at": "2024-01-11T12:00:07Z"
    },
    {
        "title": "AI, China and Israel...Countdown to Prophecy | Marking the End Times",
        "description": "This week on Marking the End Times, I discuss the megatrends shaping the world in 2024. In this episode, I'll explore the ascent of AI, China's impact on global events, upcoming elections, narratives surrounding climate change, and more.",
        "thumbnail": "https://i.ytimg.com/vi/9DM6wjQz8U4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=9DM6wjQz8U4",
        "duration": "PT12M55S",
        "published_at": "2024-01-04T12:00:05Z"
    },
    {
        "title": "We’ve Been Through A Lot This Year… | Marking The End Times",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/7zrQcHvfmn8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=7zrQcHvfmn8",
        "duration": "PT12M45S",
        "published_at": "2023-12-28T12:00:05Z"
    },
    {
        "title": "It's Closer Than We Think | Israel's Next War | Marking The End Times",
        "description": "This week on Marking the End Times, I want to discuss Israel’s next war. There is growing fear that a war on Israel’s northern front will begin soon against Hezbollah. I want to take this time to discuss the significant prophetic implications of this possible war.\n\nIn the subscriber section of the show, I answer questions such as, “During the Feast of Trumpets, I had such high hopes for the Rapture to occur. I was disappointed that it didn't happen. Am I wrong in being disappointed that we didn't get raptured during that time?”\n\nSupport Tipping Point Ministries\n\nFor some of you reading this, you can give a substantial gift to Tipping Point Ministries. As we near the end of the year, please pray about giving a sacrificial gift to help us grow the outreaches of this ministry.\n\nWe need your generosity to help sustain the daily needs of a content ministry that is in high demand. We are reaching people everyday with a message that provides hope and encouragement in a world that is being shaken.\n\nhttps://give.endtimes.com",
        "thumbnail": "https://i.ytimg.com/vi/C2i-Clm7LvE/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=C2i-Clm7LvE",
        "duration": "PT13M41S",
        "published_at": "2023-12-21T12:00:13Z"
    },
    {
        "title": "A Prophetic Look at World Events and Future Peace | Mark Hitchcock",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/W7SDZT0dUOI/sddefault.jpg",
        "url": "https://www.youtube.com/watch?v=W7SDZT0dUOI",
        "duration": "PT14M54S",
        "published_at": "2023-12-14T12:00:21Z"
    },
    {
        "title": "Prophetic Warning To America & The Many Unseen Threats | Marking The End Times with Mark Hitchcock",
        "description": "This week on Marking the End Times, I’m discussing the heightened terrorist threat facing the United States. This has significant prophetic implications that I want to unpack for you as they are important to understand.\n\nIn the subscriber only section I answer your questions, such as, “Christians have thousands of different languages and dialects from each country. How can we communicate with other people in heaven? Will everyone understand each other? Will we have a universal language?”\n\n**Visit endtimes.com for more Bible prophecy updates and content.**",
        "thumbnail": "https://i.ytimg.com/vi/2JN08XbCx4A/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=2JN08XbCx4A",
        "duration": "PT15M2S",
        "published_at": "2023-12-07T18:00:01Z"
    },
    {
        "title": "Major End Times Deception Warning | Marking The End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I want to talk to you about false prophets and sorcery. Recently, there has been a significant rise globally in psychics, false prophets, and fortune tellers. I talk about the significance of this trend related to Bible prophecy.\n\nIn the subscriber portion of the show, I answer your questions, such as, “We read Acts 1:7 in church on Sunday. It says, ‘It is not for you to know the times or dates the Father has set by his own authority.’ How would you explain this compared to your encouragement for believers to look for signs of the times? Am I missing context?” and more!",
        "thumbnail": "https://i.ytimg.com/vi/DGUgQrksQ7Y/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=DGUgQrksQ7Y",
        "duration": "PT13M46S",
        "published_at": "2023-11-30T12:00:18Z"
    },
    {
        "title": "What Is Going On?? Breaking Down The Israel-Hamas Ceasefire | Marking the End Times | Mark Hitchcock",
        "description": "This week on Marking the End Times, I want to discuss the Israel-Hamas truce. I explain the conflict so far, the details of the four day peace deal and explain Israel’s history with peace treaty’s in the past.",
        "thumbnail": "https://i.ytimg.com/vi/M8hp9DKz2Qw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=M8hp9DKz2Qw",
        "duration": "PT14M1S",
        "published_at": "2023-11-23T11:45:02Z"
    },
    {
        "title": "Israel & Turkey Tension Rises | Marking The End Times",
        "description": "Today on Marking the End Times, I want to focus on the Israel-Turkey alliance. I start by diving into the significance of Turkey in light of Ezekiel 38 and the Gog Magog war. I also explain how Turkey’s President, Recep Tayyip Erdogan, called Israel a \"terrorist state.\"\n\nIn the subscriber portion of the show, I answer your questions, such as “How can Satan come freely into God's presence to accuse us as indicated in scripture?” and “Is it true that in the Gog-Magog War God wins it for Israel supernaturally with an earthquake?” \n\nSubscribe for more updates on prophetic insights and join the community at EndTimes.com",
        "thumbnail": "https://i.ytimg.com/vi/mRdl1UupdDw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=mRdl1UupdDw",
        "duration": "PT12M29S",
        "published_at": "2023-11-16T12:00:46Z"
    },
    {
        "title": "Israel's Second War for Independence | Marking The End Times with Dr. Mark Hitchcock",
        "description": "**Visit endtimes.com for more Bible prophecy updates and content.**\n\nThis week on Marking the End Times, I discuss the current war and coming peace in the Middle East. I spend this time focusing on the Israel-Gaza war, the conflict with Hezbollah and the goal of peace. I also share some recent articles about the coming peace.\n\nIn the subscriber version, I answer questions, such as “Will the Rapture occur BEFORE Israel invades Iran?” and “When we get to Heaven, will we see three persons individually—Father, Son and Holy Ghost—or will there just be one person?”\n\n**Visit endtimes.com for more Bible prophecy updates and content.**",
        "thumbnail": "https://i.ytimg.com/vi/Wq6uBKAXaJE/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Wq6uBKAXaJE",
        "duration": "PT12M4S",
        "published_at": "2023-11-09T12:00:35Z"
    },
    {
        "title": "Are We Prepared for the Consequences???  | Marking the End Times | Dr. Mark Hitchcock",
        "description": "**Visit endtimes.com for more Bible prophecy updates and content.**\n\nThis week on Marking the End Times, I discuss antisemitism and its significance as a sign of the times. As we witness a 400% increase in global antisemitism, I aim to shed light on the connection between the hatred of Jews and Israel. \n\nIn the paid subscriber portion, I answer a few subscriber questions, such as “When I read Matt 24, I get confused. Verses 1-35 are clearly talking about the Second Coming. But when I get to verse 36, it seems to be talking about the Rapture. Can you help clarify this?”\n\n#AntiSemitism #EndTimes #TippingPoint #MarkingTheEndTimes #BibleProphecy #Israel #JewishPeople\n\n**Visit endtimes.com for more Bible prophecy updates and content.**",
        "thumbnail": "https://i.ytimg.com/vi/UnzAuBf0J-0/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=UnzAuBf0J-0",
        "duration": "PT13M35S",
        "published_at": "2023-11-02T10:00:25Z"
    },
    {
        "title": "Iran's Endgame and Gog-Magog War Next??  | Marking the End Times | Mark Hitchcock",
        "description": "**Visit endtimes.com for more Bible prophecy updates and content.**\n\nToday on Marking the End Times, I continue the coverage of the Israel-Gaza War and the fact that we have now reached day 20 since the horrific Hamas-led violence started.\n\nI explain Israel’s prep for a ground invasion and what Iran has in store. I also read Ezekiel 38 to expose the connections between the ongoing Israel-Gaza conflict and the prophesied Gog-Magog War.\n\nIn the paid subscriber portion, I answer a few subscriber questions, such as “Is God using what is happening today to bring the Jews back to their land?”\n\n**Visit endtimes.com for more Bible prophecy updates and content.**",
        "thumbnail": "https://i.ytimg.com/vi/kmaDjTfp62c/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=kmaDjTfp62c",
        "duration": "PT14M49S",
        "published_at": "2023-10-26T11:00:40Z"
    },
    {
        "title": "Decoding Gaza Headlines and the End Times Significance | Marking the End Times w/ Dr. Mark Hitchcock",
        "description": "**Visit endtimes.com for more Bible prophecy updates and content.**\n\nThis week on Marking the End Times, we’re discussing Gaza’s role in biblical prophecy. Surprisingly, the Bible mentions Gaza around 20 times, from its early references in Genesis to its significant prophecies in the Old Testament.\n\nThroughout history, from Abraham’s era to the battles between Israelites and Philistines, Gaza has always been prominent. Stories like Samson’s feats are closely tied to this ancient city. Moreover, prophets like Jeremiah and Zephaniah predicted events for Gaza, some of which seem similar to today's occurrences.\n\nZephaniah’s prediction about Gaza’s desolation appears to point to a significant future event called the Day of the Lord, when God might intervene in a major way. While it’s interesting to link current Gaza events to these prophecies, I believe their true significance might be seen in the future.\n\nIn the paid subscriber section of the show, you’ll get an exclusive deep dive into the current Israel-Gaza conflict and how it may be setting the stage for the prophesied Gog-Magog war. \n\nInterestingly, current global events, like the discussions between Vladimir Putin and Xi in Beijing, and the geopolitical shifts with Russia, Turkey, and the U.S., mirror the prophetic scriptures in Ezekiel 38 and 39. \n\nJoin me as we explore these prophetic fault lines and their significance in today’s world events, potentially pointing towards the coming events mentioned in the Bible.\n\n**Visit endtimes.com for more Bible prophecy updates and content.**",
        "thumbnail": "https://i.ytimg.com/vi/bgGo0fbmAUE/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=bgGo0fbmAUE",
        "duration": "PT18M17S",
        "published_at": "2023-10-19T11:00:35Z"
    },
    {
        "title": "The Prophetic Significance of the Israel-Gaza War | Marking the End Times with Dr. Mark Hitchcock",
        "description": "**Visit endtimes.com for more Bible prophecy updates and content.**\n\nThis week on Marking the End Times, I discuss the war in Israel. I take this time to explain the background and history of Israel, who the Palestinians really are, and an update on what is happening in Israel.\n\nPaid subscribers have access to exclusive content where I answer questions posted this week by our subscriber community including, “Is Gaza part of Israel?”\n\nBe sure to share this with friends and family and encourage them to subscribe to this channel and endtimes.com. Your subscription helps us with the resources we need to bring you content like this on a consistent basis. Tipping Point ministries is more relevant than ever and we rely on subscriptions and donations to reach as many people with the message of hope, salvation and Bible prophecy. \n\n**Visit endtimes.com for more Bible prophecy updates and content.**",
        "thumbnail": "https://i.ytimg.com/vi/mVfpiLZIutk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=mVfpiLZIutk",
        "duration": "PT14M38S",
        "published_at": "2023-10-12T11:00:29Z"
    },
    {
        "title": "Uncovering how Russian nukes are linked to the alert | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss the National Emergency Alert System that happened yesterday. I explain how to be careful of the conspiracy theories, what happened in Russia, and how to respond to this alert.\n\nSubscribers will have access to exclusive content where I answer questions, such as \"I know that there will be no sorrow in Heaven or during the Millennial Reign, but how will we cope and not worry about a family member that was an Unbeliever?\"\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/933raAnZq44/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=933raAnZq44",
        "duration": "PT13M56S",
        "published_at": "2023-10-05T11:00:07Z"
    },
    {
        "title": "Four recent events that signal a coming peace treaty | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I am discussing four major events surrounding Israel and Saudi Arabia. There have been some significant advances toward a peace treaty, as it relates to the ends times.\n\nSubscribers have access to exclusive content where I answer questions, such as \"When the Rapture does take place, will the rods and screws that hold my spine straight due to scoliosis (since the age of 13) be left behind?\"\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/8sRRH7jyWRc/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=8sRRH7jyWRc",
        "duration": "PT14M15S",
        "published_at": "2023-09-28T11:00:13Z"
    },
    {
        "title": "Global Debt and the Economic Armageddon  | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I am discussing recent news about the record-high global debt and what it means. I also explain the threat to our nation’s future as national debt continues to rise.\n\nPaid subscribers will have access to exclusive content where I answer questions such as, “Do Scriptures allow women to be a Deacon?” and “When will the Judgement Seat of Christ take place?”\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/4zPMGRv7waA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=4zPMGRv7waA",
        "duration": "PT13M54S",
        "published_at": "2023-09-21T11:46:49Z"
    },
    {
        "title": "Breaking: This Could Lead to the Third Temple | Marking the End Times with Dr. Mark Hitchcock",
        "description": "Today on Marking the End Times, I am excited to discuss a significant archaeological discovery: the Pool of Siloam. We will explore the recent excavation and its implications, shedding light on the pool's historical importance and its connection to the end times.\n\nIn the paid subscriber portion, I answer questions such as \"What determines if you are part of the 50% of Christians to go in the rapture?\" and \"Are shark attacks a sign of the end times?\"\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/2iDvvqK7jqE/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=2iDvvqK7jqE",
        "duration": "PT14M45S",
        "published_at": "2023-09-14T11:00:03Z"
    },
    {
        "title": "The Antichrist Loves This New Payment System | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss central bank digital currencies and how they continue to accelerate. I also explain how I believe a new Federal payment system could be just what the Antichrist needs to lead a cashless society.\n\nSubscribers will have access to exclusive content where I answer questions such as, \"Will we have the same personalities in heaven?\" and \"Did Jesus descend into Hell after his death?\"\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/q2qxzq9li8s/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=q2qxzq9li8s",
        "duration": "PT13M6S",
        "published_at": "2023-09-07T11:00:40Z"
    },
    {
        "title": "Surprising Update on the Gog-Magog Coalition | Marking the End Times with Dr. Mark Hitchcock",
        "description": "Today on Marking the End Times, I discuss the ongoing events in Libya, particularly the protests concerning relations with Israel. I dive into the expansion of the Abrahamic Accords and explain why I believe this indicates the possible formation of the Gog-Magog Coalition and its significance.\n\nFor paid subscribers, I answer the following questions: Does Daniel 12 suggest a post-tribulation rapture? and Is the \"Father's House\" a temporary or permanent dwelling?\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/HaaAX1MMrKA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=HaaAX1MMrKA",
        "duration": "PT14M9S",
        "published_at": "2023-08-31T11:00:12Z"
    },
    {
        "title": "Exposing the Antichrist's Plan for World Control | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking The End Times, I have a very important message for you regarding the mark of the beast and a cashless society. I explain this topic in depth as well as discuss the cashless payment system Amazon One. \n\nSubscribers will have access to the entire show where I answer the very important question, \"Will we be judged on things we did before coming to Christ?\" as well as more.\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/PAbUQsTIIXg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=PAbUQsTIIXg",
        "duration": "PT14M39S",
        "published_at": "2023-08-24T11:00:16Z"
    },
    {
        "title": "Is This The Antichrist Deal of the Century? | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I am discussing the normalization of relations between Saudi Arabia and Israel. I explain why this matters and how it relates to the Antichrist’s covenant for 7 years. I’m also discussing the history of Israel’s peace treaties and why Saudi Arabia’s is the most important.\n\nSubscribers have access to the entire video which includes exclusive content where I answer questions such as, \"When will we receive our glorified bodies?\" and \"Where will the New Jerusalem be?\"\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/3MYMflzyhSA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=3MYMflzyhSA",
        "duration": "PT13M41S",
        "published_at": "2023-08-17T11:00:02Z"
    },
    {
        "title": "Important News from End Times \"Ground Zero\" | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss the rebuilding on the Temple Mount as a significant end times prophecy. I also explain the importance of the red heifer to the rebuilding of the temple.\n\nPaid subscribers have access to exclusive content where I answer questions such as “Do unbelievers receive their eternal bodies before believers?” and “Is it appropriate to refer to the “restored” temple during the Millennium as the 4th Temple?”\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/r3kRCYd2_DE/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=r3kRCYd2_DE",
        "duration": "PT13M13S",
        "published_at": "2023-08-10T11:00:45Z"
    },
    {
        "title": "Biblical Evidence for a Pre-tribulation Rapture | Marking the End Times with Dr. Mark Hitchcock",
        "description": "Today on Marking the End Times, I will be discussing the tribulation period. I explain the Biblical evidence of the pre-trib rapture as well as opposing viewpoints. I also dive deeper into the aspects of Biblical prophecy that the post-trib arguments have overlooked.\n\nSubscribers will have access to an exclusive portion of the show where I answer the questions “Do we have to wait until the next Shmita cycle for the rapture to happen?” and “Do we need to keep the sabbath or is it just for the nation of Israel?”\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/Tklcvhy6xVI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Tklcvhy6xVI",
        "duration": "PT9M59S",
        "published_at": "2023-08-03T11:00:32Z"
    },
    {
        "title": "Does Revelation Describe a Nuclear Apocalypse? | Marking the End Times with Dr. Mark Hitchcock",
        "description": "Today on Marking the End Times, I discuss the new movie Oppenheimer and how it has stoked fears of a nuclear apocalypse. I discuss whether or not nuclear weapons are mentioned in the Bible. I also illustrate the history of the nuclear bomb and whether or not we should fear the prospects of nuclear world war in these tumultuous times.\n\nIn the subscriber portion, I answer the questions, “How can we be caught up to meet Jesus if we haven't died yet according to Hebrews 9:27?“, “Should women be pastors?“, and “Can a person lose their salvation?”\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/PmBdpuyZw48/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=PmBdpuyZw48",
        "duration": "PT14M24S",
        "published_at": "2023-07-27T11:00:29Z"
    },
    {
        "title": "Joe Biden Needs to Hear These Four Truths | Marking the End Times with Dr. Mark Hitchcock",
        "description": "Visit https://endtimes.com to access this entire video.\n\nToday on Marking the End Times, I discuss the deteriorating culture of America. I outline four ways that a nation can experience God's blessings. \n\nAdditionally, I explain why America's absence in prophecy could signify implications for the future of our nation and culture. Lastly, I share my perspective on our country's ongoing decline and why we shouldn't worry about the fall of America.\n\nIn the subscriber section, I'll be answering questions such as, “Is Bigfoot a part of the Nephilim?” and “Are solar flares and blackouts relevant to end times prophecy?”\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/UQSope2iofM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=UQSope2iofM",
        "duration": "PT13M26S",
        "published_at": "2023-07-20T14:09:25Z"
    },
    {
        "title": "Disturbing End Times Trends Exposed | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I take a look at some of the deceptive lies Satan is telling us. I dive deeper into how Satan is striking the heart of humanity and creating a culture of self. I also talk about America in the end times.\n\nSubscribers will have access to exclusive content where I answer questions such as “Can you explain “laying down your crown” at the feet of Jesus? Is the crown a reward for good works?” and \"How do Genesis 10 and Ezekiel 38 fit together?\"\n\nVisit https://endtimes.com to access this entire video.",
        "thumbnail": "https://i.ytimg.com/vi/ArZCvMMilgI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=ArZCvMMilgI",
        "duration": "PT13M5S",
        "published_at": "2023-07-13T11:00:06Z"
    },
    {
        "title": "Has Sodom Been Discovered in Jordan? | Marking the End Times with Dr. Mark Hitchcock",
        "description": "Today on Marking the End Times, I'm talking about the shocking discovery of the ancient city of Sodom. I'm reviewing the evidence that the archeological site is Sodom, discussing the prophetic implications, and why it’s important. Later on in the show I'm explaining how Sodom and Gomorrah are the blueprint of what will happen to the earth in the end times.\n\nIn the subscriber portion, I will be answering the questions: “Are unbelievers in hell before they are resurrected?” and “Will those who are called before God at the final judgment be called out of hell and then sent back into hell?”\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/ijFj9D9Oz9c/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=ijFj9D9Oz9c",
        "duration": "PT14M36S",
        "published_at": "2023-07-06T11:00:35Z"
    },
    {
        "title": "Is the Gog-Magog War Imminent? | Marking the End Times with Dr. Mark Hitchcock",
        "description": "Today on Marking the End Times, I discuss the Wagner Revolt in Russia. I start off by explaining the 5 things we don't know about it and the 4 things we do know because of Gog-Magog War prophecies.  \n\nIn the subscriber portion, I answer questions such as, \"Why aren't Arab nations mentioned in Ezekiel 38?\" and \"Will only Christians who ‘overcome’ be taken in the rapture?”\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/tTcAII30fjU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=tTcAII30fjU",
        "duration": "PT13M31S",
        "published_at": "2023-06-29T11:00:43Z"
    },
    {
        "title": "Uncovering the AI \"Mystery\" of the End Times! | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I am delving into some disconcerting advancements in AI technology. I explore various ways AI can be exploited for nefarious purposes, including blackmail, deep fakes, and its unsettling implementation in churches.\n\nAs a subscriber, you will gain access to exclusive content where I tackle questions like \"Are the second coming and the rapture the same event?\" and \"What does being the 'bride of Christ' entail?\"\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/9xuQ8AttvoU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=9xuQ8AttvoU",
        "duration": "PT14M32S",
        "published_at": "2023-06-22T11:00:08Z"
    },
    {
        "title": "What's the Latest on the Red Heifer Mystery? | Marking the End Times with Dr. Mark Hitchcock",
        "description": "Today on Marking the End Times, I am giving an update on the Red Heifers. I discuss the six Biblical requirements for a red heifer sacrifice and how the heifers sent to Israel fit within these criteria. I also delve into how the rebuilding of the temple appears imminent.\n\nIn the subscriber portion, I address questions like \"How does the 6th bowl judgment relate to China?\" and \"Will we find our soulmates in heaven if we never got married on earth?\"\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/yLUby2YrsZo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=yLUby2YrsZo",
        "duration": "PT14M9S",
        "published_at": "2023-06-15T11:00:44Z"
    },
    {
        "title": "Unbelievable: Iron Dome Challenged by Iran's Hypersonic Missiles | Marking the End Times",
        "description": "Today on Marking the End Times, I am talking about major recent developments in Iran. I discuss Iran's claim to having a hypersonic missile and the effects this may have on Israel since it can avoid the Iron Dome, and what it means for end times prophecy.\n\nIn the subscriber portion, I am answering question such as, \"Will there be a forbidden tree in heaven?\" and \"What kind of work will people do during the Millennium?\"\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/eqWiIIicCiM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=eqWiIIicCiM",
        "duration": "PT12M46S",
        "published_at": "2023-06-08T11:00:26Z"
    },
    {
        "title": "Major Gog & Magog News from Turkey | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss recent election news from Turkey, and why I believe President Erdoğan's runoff victory has significant implications for the Gog & Magog War, based on prophecies from Ezekiel 38 and 39.\n\nAs a paid subscriber, you'll gain access to the full episode where I'll be answering questions like, “What do marriage and relationships look like in Heaven?” and “After the seal, bowl, and trumpet judgments in Revelation occur, how will the world be restored at the end of the Tribulation period?”\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/s_hgNbBkzuE/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=s_hgNbBkzuE",
        "duration": "PT11M51S",
        "published_at": "2023-06-01T11:00:39Z"
    },
    {
        "title": "Uncovering the Mysterious Jewish Tribe in Revelation 7 | Marking the End Times w/ Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I talk about the 144,000 people in Revelation 7 and which Jewish tribes make up this group. I explain that there are 3 groups of Jews in the end times and their roles and responsibilities during the tribulation.\n\nIf you're a paid subscriber, you'll have access to the full episode where I'll be answering questions like “What is the age of accountability according to the Bible?” and “If the Old Testament saints aren't raised until the Millennium, what judgment do they go through?”\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/4-oDc1tDVyY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=4-oDc1tDVyY",
        "duration": "PT12M32S",
        "published_at": "2023-05-25T11:00:05Z"
    },
    {
        "title": "Israel's Future is a Major End Times Super Sign | Marking the End Times with Dr. Mark Hitchcock",
        "description": "In this week's episode of Marking the End Times, I dive deeper into Israel's future. I'll be discussing 7 key events or mile markers that will help us understand what's in store for the nation of Israel. \n\nIf you're a paid subscriber, you'll have access to the full episode where I'll be answering questions like \"Is hell only for Satan and his angels or will people go?\" and \"What happens to people who never hear about the Gospel?\"\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/olmoCDVa4Co/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=olmoCDVa4Co",
        "duration": "PT13M4S",
        "published_at": "2023-05-18T11:00:40Z"
    },
    {
        "title": "Illegal Immigration and the One World Government | Marking the End Times with Dr. Mark Hitchcock",
        "description": "Today on Marking the End Times, I am discussing the Immigration Crisis and its relation to the Tower of Babel. I explain how I believe open borders lead to global rule under one leader.\n\nPaid subscribers will have access to the full episode, where I address questions such as, \"How might Christians need to adapt before the rapture?\" and \"Why is there so much confusion about the timing of the rapture?\"\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/Fnw6WfGTEcA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Fnw6WfGTEcA",
        "duration": "PT13M49S",
        "published_at": "2023-05-11T11:00:15Z"
    },
    {
        "title": "This Assassination Attempt Could Lead to Nuclear War | Marking the End Times with Dr. Mark Hitchcock",
        "description": "Today on Marking the End Times, I discuss the shocking development in the Russia-Ukraine War. I explain what I believe this means in light of the Gog & Magog War.\n\nPaid subscribers will have access to the full episode where I address questions such as \"Who institutes the Mark of the Beast?\" and \"How do we know that Persia is modern-day Iran?\"\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/Fx_mFoazHrM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Fx_mFoazHrM",
        "duration": "PT11M36S",
        "published_at": "2023-05-04T15:00:10Z"
    },
    {
        "title": "Unraveling the Reason Behind Historic Military Spending! Marking the End Times w/ Dr. Mark Hitchcock",
        "description": "In this week's episode of Marking the End Times, I discuss world military spending reaching an all-time high—over 2 trillion dollars—and delve into how this creates a dangerous and unstable world.\n\nLink to the article I referenced: https://www.sipri.org/media/press-release/2023/world-military-expenditure-reaches-new-record-high-european-spending-surges\n\nAs a subscriber, you will have access to the full episode where I address questions like, \"Do you think an earthquake will cause the destruction of Damascus?\" and \"Why have Jews historically faced hatred and abuse from the world?\"\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/lRqMGDmdSyk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=lRqMGDmdSyk",
        "duration": "PT12M42S",
        "published_at": "2023-04-27T11:00:23Z"
    },
    {
        "title": "Temple Mount Tensions Rising in Recent Days | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I want to talk about the Temple Mount, or what I call the \"prophetic hot spot.\" I will explain the recent tension surrounding the Temple Mount and its significance.\n\nAs a subscriber, you will be able to watch the full episode where I answer questions such as, \"I've been told that humans are controlling the earthquakes, floods, and other natural disasters that are happening. Is that possible? Would God allow that?\" as well as, \"For the people who die for their faith during the 7-year Tribulation, where do they go?\"\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/VouVAL0s_1k/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=VouVAL0s_1k",
        "duration": "PT13M40S",
        "published_at": "2023-04-20T11:00:20Z"
    },
    {
        "title": "Leaked Pentagon Documents Reveal the End Times Truth | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss the recent document leak within the Pentagon pertaining to Egypt and Russia, and how it relates to the end times.\n\nIn the subscriber portion, I answer several questions including this very interesting one, “Could Donald Trump signing the Abraham Accords on 9-15-2020 have started the Tribulation?”\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/IxgU8s78RwU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=IxgU8s78RwU",
        "duration": "PT12M7S",
        "published_at": "2023-04-13T11:00:11Z"
    },
    {
        "title": "Society Is Crumbling and Chaos Abounds, What’s Next? | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss Psalms 11 and how the foundations of the culture and church are crumbling. Although the signs of our times may be discouraging, I explain the hope we have to hold onto.\n\nAs a subscriber, you will have access to the exclusive addition of the show that includes a Q&A session. I answer questions such as, “Why was the tribe of Dan excluded from the twelve tribes of Israel that contains the 144,000, but then reappears in Ezekiel creating thirteen tribes?”\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/S6kEwmul4_I/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=S6kEwmul4_I",
        "duration": "PT14M3S",
        "published_at": "2023-04-06T11:00:19Z"
    },
    {
        "title": "An End Times Perspective on the Nashville Shooting | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss the shocking, recent tragedy of the Nashville shooting. As details come in about this, I explain how I believe it outlines the rising hatred against Christianity in America. \n\nIn the endtimes.com subscriber-only portion I answer questions such as,  \"When will God send the deluding influence?\", \"Could the length of a generation be up to 100 years?\", and \"How do the new earth, the new heaven, and the new Jerusalem fit together?\"\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/L3tYgO73F7M/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=L3tYgO73F7M",
        "duration": "PT13M26S",
        "published_at": "2023-03-30T11:00:13Z"
    },
    {
        "title": "Praying for Armageddon | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I am talking about the new documentary film, Praying for Armageddon, and how it misrepresents those who believe in Biblical prophecy. I dive deeper into how this reflects a bigger problem in society that rejects God and rejects Christianity.  \n\nSubscribers have access to the exclusive edition of the show that includes an in depth Q&A session. I will be answering questions such as, \"Who are the elect in Matthew 24:31?\" and \"Could the earthquakes in Turkey be the opening of the great abyss mentioned in Revelation 9?”\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/tLYm4NUb1vY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=tLYm4NUb1vY",
        "duration": "PT12M48S",
        "published_at": "2023-03-23T11:00:41Z"
    },
    {
        "title": "Live from Israel & The Feast of Purim 2023 | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I’m recording the show from Israel and I discuss the Feast of Purim and it’s End Times implications. I dive deeper into the history of the Feast of Purim and how it relates to Iran today.\n\nIn the subscriber portion, I answer questions such as “Is the Asbury Revival the end times revival that is prophesied about in end times prophecy?\" and \"Do you believe in the Illuminati or the New World Order, and are these part of End Times prophecy?\"\n\nTo become a subscriber and access this entire video, please visit https://endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/N6ErfGGiKwQ/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=N6ErfGGiKwQ",
        "duration": "PT11M18S",
        "published_at": "2023-03-09T12:00:13Z"
    },
    {
        "title": "Rapture Anxiety and End Times Teaching Extremism | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss how Biblical and prophetic teaching is often seen as radical, toxic, and extreme. I also explain how I believe rapture anxiety is affecting younger generations and what the news says about Premillennialism.\n\nIn the subscriber portion, I discuss the timing of the Gog-Magog invasion as it relates to the tribulation and antisemitism in our world today. I also answer the question, \"Is the Rapture really in the Bible?\"\n\nTo become a subscriber and access this entire video, please visit endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/gPlVf0B_CEg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=gPlVf0B_CEg",
        "duration": "PT11M40S",
        "published_at": "2023-03-02T12:00:32Z"
    },
    {
        "title": "The Antichrist Wants Your Money | Marking the End Times with Dr. Mark Hitchcock",
        "description": "In today's episode of Marking the End Times, I am talking about the future of central bank digital currencies and their prophetic implications. I also discuss how this is already in place in some countries and how they are preventing people from saving money.\n\nIn the subscriber-only portion, I answer questions such as, \"Will there be more people in hell than in heaven?” and \"Can people in heaven see or know what's happening on the earth?\"\n\nTo become a subscriber and access this entire video, please visit endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/Xv_TGDjEgxY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Xv_TGDjEgxY",
        "duration": "PT12M55S",
        "published_at": "2023-02-23T12:00:31Z"
    },
    {
        "title": "Making Sense of Recent UFO Sightings | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I am discussing how demonic deception could be what is leading people to continually spot UFO's, especially after the events that happened this past week. I compare the time we are living in to 1947 when there was \"UFO Fever.\"\n\nIn the subscriber-only portion, I answer questions such as \"Where do demons come from?\" and \"Is demonic activity going to increase as we get closer to the rapture?” \n\nI end by explaining why we don't need to be afraid of the devil if we submit our lives to God.\n\nTo become a subscriber and access this entire video, please visit endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/Y9tHGJsF9bE/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Y9tHGJsF9bE",
        "duration": "PT15M45S",
        "published_at": "2023-02-16T12:00:30Z"
    },
    {
        "title": "Iran, Russia and Turkey Give a Glimpse of Armageddon | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss how Russia, Turkey, and Iran are tightening their alliances with each other. I go through headlines that mention examples of this alliance and also talk about how this “axis of evil” could play a part in significant end times events.\n\nIn the subscriber-only portion, I talk about my beliefs on Ezekiel 38 and answer the question, \"Is the Antichrist alive today?\"\n\nTo become a subscriber and access this entire video, please visit endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/AbW2yY8hW4s/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=AbW2yY8hW4s",
        "duration": "PT12M26S",
        "published_at": "2023-02-09T12:00:06Z"
    },
    {
        "title": "ChatGPT, AI, & the Coming Antichrist Kingdom | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss ChatGPT and the effects it will have on our society. I also share my beliefs about the future of AI and the knowledge it will hold.\n\nIn the subscriber-only version, I answer questions such as \"Will the Apostasy written about in 2 Thessalonians 2 come about before or after the Church is Raptured?\" and \"Do I have to be awake during the rapture to hear Jesus calling us with the trumpets?\"\n\nTo become a subscriber and access this entire video, please visit endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/k2z4pHLAYuk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=k2z4pHLAYuk",
        "duration": "PT12M52S",
        "published_at": "2023-02-02T12:00:36Z"
    },
    {
        "title": "90 Seconds to Armageddon  | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I go in depth about the Doomsday Clock and the significance of it recently being set forward 10 seconds. Even non-Believers say we are closer to Armageddon than ever before.\n\nIn the subscriber-only section, I spend the entire portion talking about a really great question regarding the World Economic Forum. I know you’ll find it fascinating and helpful as we continue to look at these world events through the lens of Bible prophecy.\n\nTo become a subscriber and access this entire video, please visit endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/eqjyouAyHEk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=eqjyouAyHEk",
        "duration": "PT13M6S",
        "published_at": "2023-01-26T12:00:21Z"
    },
    {
        "title": "Goodbye, America  | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss my belief that America will likely have a diminished role to play in Bible prophecy events.\n\nIn the subscriber version, I answer questions such as “Why doesn't the gospel of John talk about the signs of the end times?\" and \"Why does God bind Satan for 1,000 years instead of just throwing him into the lake of fire?\"\n\nTo become a subscriber and access this entire video, please visit endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/Wbaj43EReWg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Wbaj43EReWg",
        "duration": "PT12M13S",
        "published_at": "2023-01-19T13:27:53Z"
    },
    {
        "title": "Important Update on Russia's War in Ukraine | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I’m bringing some recent news from Russia, and I explain why I believe 2023 will be the decisive end to the Ukrainian War. I also talk about Putin’s declining health. \n\nIn the subscriber version, I answer questions such as “What happens to a woman and her baby if she’s pregnant during the rapture?” and “What time period is encompassed in the Bible during the ‘Day of the Lord?’” \n\nTo become a subscriber and access this entire video, please visit endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/b9QcQ3RzGeA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=b9QcQ3RzGeA",
        "duration": "PT13M15S",
        "published_at": "2023-01-12T12:00:32Z"
    },
    {
        "title": "The Imminent Return of Christ | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss the imminent return of Christ. As we head into the new year of 2023, I believe it’s important to define that word “imminent” and talk about what it means in regards to the rapture. \n\nIn the subscriber-only segment, I answer your questions about Gog and Magog nations, trumpets in Revelation, and the types of rewards you will receive as a Believer once you get to heaven. \n\nHappy New Year to all of our subscribers, and I pray you enjoy this week’s show and it’s a blessing to you!\n\nTo become a subscriber and access exclusive content please go to endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/Pf1YGONillU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Pf1YGONillU",
        "duration": "PT13M4S",
        "published_at": "2023-01-05T12:00:26Z"
    },
    {
        "title": "2022 End Times Dominoes | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, it’s a special episode since it is the last one of the year. Because of this I’m reviewing the 2022 events that helped set the stage for what I call the “End Times dominoes” to all fall into place. \n\nIn the subscriber-only segment, I answer some of your really great questions including one about ghosts and talking to the dead, one about pestilence and plagues in the last days, and one about Iran and Israel.\n\nVisit endtimes.com to become a subscriber and access all of the exclusive content.",
        "thumbnail": "https://i.ytimg.com/vi/srTx52nZoMU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=srTx52nZoMU",
        "duration": "PT15M3S",
        "published_at": "2022-12-29T22:28:27Z"
    },
    {
        "title": "Debunking Christmas Myths | Marking the End Times with Dr. Mark Hitchcock",
        "description": "On today's show, I'm sharing about Jesus' incarnation and debunking some misunderstandings about Christmas. We've all read the Christmas story, but today's episode will help you deepen your understanding about the day of Jesus' birth.\n\nIn the subscriber section I'll share one final misunderstanding about Christmas, as well as answer some of your questions.\n\nFor access to full episodes, hundreds of articles, and a community of Bible Prophecy encouragers, visit endtimes.com and become a $7/mo. subscriber.",
        "thumbnail": "https://i.ytimg.com/vi/_fexlASHAgU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=_fexlASHAgU",
        "duration": "PT12M3S",
        "published_at": "2022-12-22T12:00:21Z"
    },
    {
        "title": "The Shocking Truth About the Explosion of Knowledge | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss the prophecy in the Book of Daniel related to the explosion of knowledge in the end times.\n\nIn the subscriber-only segment, I answer your questions, such as, \"How are there sinners during the millennial reign?\" And \"How old will we be when we get our glorified body?\"\n\nFor access to full episodes, hundreds of articles, and a community of Bible Prophecy encouragers, visit endtimes.com and become a $7/mo. subscriber.",
        "thumbnail": "https://i.ytimg.com/vi/3pZikdu7rTA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=3pZikdu7rTA",
        "duration": "PT12M35S",
        "published_at": "2022-12-15T12:00:02Z"
    },
    {
        "title": "The Seven Year Antichrist Peace Treaty | Marking the End Times with Dr. Mark Hitchcock",
        "description": "This week on Marking the End Times, I discuss the importance of the coming peace treaty between Israel and the Antichrist. This peace treaty can be found in Daniel 9, which I refer to today in the program.\n\nIn the subscriber portion, I answer questions such as, “I’ve heard pastors say that only Christians who are ‘over-comers’ will be taken in the Rapture. How do I know if I am an overcomer or not?” and “Do you have an understanding in Scripture of when the Mark of the Beast will be implemented?” and “According to John 5:29 are Believers in Hell before they are resurrected?”\n\nFor access to full episodes, hundreds of articles, and a community of Bible Prophecy encouragers, visit endtimes.com a become a $7/mo. subscriber.",
        "thumbnail": "https://i.ytimg.com/vi/P8mL-1aBDUU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=P8mL-1aBDUU",
        "duration": "PT11M9S",
        "published_at": "2022-12-08T12:00:13Z"
    },
    {
        "title": "End Times Wars and Rumors of Wars | Marking the Times with Dr. Mark Hitchcock",
        "description": "This week on the Marking the End Times show, I’m taking a deep dive into the wars and rumors of wars that are plaguing the world. We live in a time that feels like war could erupt at any moment in our society. The Bible tells us this is one of the signs of the End Times.\n\nIn the subscriber-only portion of the program, I answer questions such as  “If a believer commits suicide, do they go to Heaven?” and “I have not heard anything mentioned about infants and younger children younger than the age of accountability. Will they just disappear in the Rapture and be taken up? Will parents be able to find their babies?”\n\nFor the full program be sure to subscribe at endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/GFxaergExTA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=GFxaergExTA",
        "duration": "PT12M33S",
        "published_at": "2022-11-17T18:00:10Z"
    },
    {
        "title": "Two Major End Times Rivers are Drying Up | Marking The End Times with Mark Hitchcock",
        "description": "This week on the Marking the End Times show, I’m talking about a couple of major rivers in the world that are drying up. These rivers are mentioned in scripture and have incredible Biblical significance for the End Times. \n\nIn the subscriber-only portion of the program, I answer your questions such as “Does a full temple have to be rebuilt? Couldn’t sacrifices be made in the tabernacle, which could be constructed faster than a temple?” And “How will the Temple be rebuilt if the Dome of the Rock is already there? Will it have to be destroyed first?”\n\nMarking the End Times with Mark Hitchcock is a weekly YouTube show about Bible prophecy in the End Times and is a part of https://www.endtimes.com. Come back every Thursday for a new episode, and be sure to subscribe at endtimes.com for the full show as well as hundreds of other articles and videos.",
        "thumbnail": "https://i.ytimg.com/vi/e0ehBm8P0jY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=e0ehBm8P0jY",
        "duration": "PT10M48S",
        "published_at": "2022-11-10T12:00:32Z"
    },
    {
        "title": "Is Antisemitism On The Rise? | Marking the End Times with Mark Hitchcock",
        "description": "This week on Marking the End Times show I discuss antisemitism and how it is growing in our world. I walk through news headlines as it relates to End Times and what I believe it means.\n\nIn the subscriber-only portion of the program, I answer subscriber questions such as “What happened to people who died before Jesus was born?” and “Are there Female angels?” and “Will there be sex in heaven?”\n\nFor the full program be sure to subscribe at endtimes.com.",
        "thumbnail": "https://i.ytimg.com/vi/ciN9nyCXJ-Q/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=ciN9nyCXJ-Q",
        "duration": "PT12M16S",
        "published_at": "2022-11-03T15:14:05Z"
    },
    {
        "title": "Global Digital ID & the Mark of the Beast | Marking the End Times with Mark Hitchcock",
        "description": "On today’s Marking the End Times show I discuss the Global Digital ID system that Bill Gates just gave $200M dollars to recently. This ID system is gaining momentum and is preparing us for a one-world government. I believe ultimately it sets the stage for the Antichrist to use it to control the population worldwide.\n\nIn the second part of the program I answer subscriber questions, and I know you’ll really enjoy it. Thank you for watching and God bless you.\n\nMarking the End Times with Mark Hitchcock is a weekly YouTube show about Bible prophecy in the End Times and is a part of https://www.endtimes.com. Come back every Thursday for a new episode, and be sure to subscribe at endtimes.com for the full show as well as hundreds of other articles and videos.\n\n--------\n\nMark Hitchcock is a regular contributor to endtimes.com and has authored over thirty books related to end-time Bible prophecy that have sold over one million copies. His books have been translated into over ten languages. Mark is a frequent speaker at churches and prophecy conferences both in the United States and internationally.",
        "thumbnail": "https://i.ytimg.com/vi/aCqfhax7gAU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=aCqfhax7gAU",
        "duration": "PT12M59S",
        "published_at": "2022-10-20T18:36:29Z"
    },
    {
        "title": "The Final Battle is Near | Marking the End Times with Mark Hitchcock",
        "description": "Today, Mark Hitchcock talks about President Joe Biden warning of a nuclear war with Russia. Is this Armageddon? To watch the full episode subscribe to https://endtimes.com.\n\nMarking the End Times with Mark Hitchcock is a weekly YouTube show about Bible prophecy in the end times and is a part of endtimes.com. Come back every Thursday for a new episode.\n\nMark Hitchcock is a regular contributor to endtimes.com and has authored over thirty books related to end-time Bible prophecy that have sold over one million copies. His books have been translated into over ten languages. Mark is a frequent speaker at churches and prophecy conferences both in the United States and internationally.\n\nHe was born and raised in Oklahoma City, Oklahoma. He attended Oklahoma State University and graduated from law school in 1984. After working for a judge at the Oklahoma Court of Criminal Appeals for four years, Mark was led to attend Dallas Theological Seminary, graduating in 1991. Since that time, he has served as senior pastor of Faith Bible Church in Edmond, Oklahoma. He completed his PhD at Dallas Theological Seminary in 2005 and serves as an associate professor of Bible exposition at DTS.  Mark and his wife, Cheryl, live in Edmond, Oklahoma. They have two sons, Justin (married to Natalee) and Samuel, and two grandchildren.",
        "thumbnail": "https://i.ytimg.com/vi/dW2NwyW6zbA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=dW2NwyW6zbA",
        "duration": "PT13M14S",
        "published_at": "2022-10-13T17:26:40Z"
    },
    {
        "title": "Marking the Times - New year 2022 Episode",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/Z380wdGFj8E/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Z380wdGFj8E",
        "duration": "PT3M15S",
        "published_at": "2022-01-24T13:52:43Z"
    },
    {
        "title": "Marking the Times Episode 178",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/opYQoO1__1Y/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=opYQoO1__1Y",
        "duration": "PT5M28S",
        "published_at": "2021-12-19T17:42:13Z"
    },
    {
        "title": "Marking the Times Episode 172   10 Horns",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/sXYkwt1aiWQ/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=sXYkwt1aiWQ",
        "duration": "PT5M18S",
        "published_at": "2021-11-23T03:02:04Z"
    },
    {
        "title": "Marking the Times Episode 177",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/_JAur1QuGOk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=_JAur1QuGOk",
        "duration": "PT5M33S",
        "published_at": "2021-11-23T02:50:26Z"
    },
    {
        "title": "Marking the Times Episode 176   Halloween Special",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/K5Vmz-ZsTxg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=K5Vmz-ZsTxg",
        "duration": "PT7M44S",
        "published_at": "2021-10-31T13:17:49Z"
    },
    {
        "title": "Marking the Times Episode 174   Auhtoritarianism",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/Ie6vHIH7Ci0/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Ie6vHIH7Ci0",
        "duration": "PT5M53S",
        "published_at": "2021-10-25T19:49:01Z"
    },
    {
        "title": "Marking the Times Episode 173   Apostasy in the Church",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/VAtZ2joF-Bc/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=VAtZ2joF-Bc",
        "duration": "PT5M38S",
        "published_at": "2021-10-25T19:43:59Z"
    },
    {
        "title": "Marking the Times Episode 171   Iran Update",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/GQQFjzOId98/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=GQQFjzOId98",
        "duration": "PT5M49S",
        "published_at": "2021-09-22T16:07:10Z"
    },
    {
        "title": "Marking the Times Episode 170   Deception",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/GtYhRXEZGt8/sddefault.jpg",
        "url": "https://www.youtube.com/watch?v=GtYhRXEZGt8",
        "duration": "PT6M54S",
        "published_at": "2021-09-07T17:27:18Z"
    },
    {
        "title": "Marking the Times Episode 169   Afghanistan",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/8NK5Ep1ZkE8/sddefault.jpg",
        "url": "https://www.youtube.com/watch?v=8NK5Ep1ZkE8",
        "duration": "PT7M29S",
        "published_at": "2021-08-28T17:12:01Z"
    },
    {
        "title": "Marking the Times Episode 168   Afghanistan Update",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/EwsgTtIPHoU/sddefault.jpg",
        "url": "https://www.youtube.com/watch?v=EwsgTtIPHoU",
        "duration": "PT6M54S",
        "published_at": "2021-08-27T20:49:02Z"
    },
    {
        "title": "Marking the Times Episode 167   Satan's Seed",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/5vB77RyfJxg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=5vB77RyfJxg",
        "duration": "PT7M8S",
        "published_at": "2021-08-18T13:48:52Z"
    },
    {
        "title": "Marking the Times Episode 166   Authoritarianism",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/CqcOD-grpgk/sddefault.jpg",
        "url": "https://www.youtube.com/watch?v=CqcOD-grpgk",
        "duration": "PT7M20S",
        "published_at": "2021-08-18T02:27:10Z"
    },
    {
        "title": "Marking the Times Episode 165   A Bad Argument For the Tribulation",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/t3o9BaGAY0I/sddefault.jpg",
        "url": "https://www.youtube.com/watch?v=t3o9BaGAY0I",
        "duration": "PT6M46S",
        "published_at": "2021-07-26T14:12:18Z"
    },
    {
        "title": "Marking the Times Episode 164   The Syrian Civil War",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/E7f9XrY06lw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=E7f9XrY06lw",
        "duration": "PT5M49S",
        "published_at": "2021-07-26T14:03:23Z"
    },
    {
        "title": "Marking the Times Episode 163   UFO Teaser",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/0dth-pxZwXw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=0dth-pxZwXw",
        "duration": "PT7M26S",
        "published_at": "2021-07-26T13:58:29Z"
    },
    {
        "title": "Marking the Times Episode 162   Iran Update",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/hhwe_vPFieM/sddefault.jpg",
        "url": "https://www.youtube.com/watch?v=hhwe_vPFieM",
        "duration": "PT5M46S",
        "published_at": "2021-06-27T17:43:36Z"
    },
    {
        "title": "Marking the Times Episode 160   Israel's New Government",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/ddk6O-_meEs/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=ddk6O-_meEs",
        "duration": "PT5M54S",
        "published_at": "2021-06-19T22:22:01Z"
    },
    {
        "title": "Marking the Times Episode 159   Matthew 24",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/VD1nLa_F-Oc/sddefault.jpg",
        "url": "https://www.youtube.com/watch?v=VD1nLa_F-Oc",
        "duration": "PT6M3S",
        "published_at": "2021-06-19T22:18:31Z"
    },
    {
        "title": "Marking the Times Episode 157   Israel Update",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/hywBzmve9Tk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=hywBzmve9Tk",
        "duration": "PT6M59S",
        "published_at": "2021-05-15T12:58:23Z"
    },
    {
        "title": "Marking the Times Episode 152   Update on the Middle East",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/b9L6SMldW2Q/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=b9L6SMldW2Q",
        "duration": "PT4M55S",
        "published_at": "2021-04-27T18:18:22Z"
    },
    {
        "title": "Marking the Times Episode 153   Prophecy Update",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/qMxlAmVFv-4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=qMxlAmVFv-4",
        "duration": "PT6M25S",
        "published_at": "2021-04-27T18:16:30Z"
    },
    {
        "title": "Marking the Times Episode 151   God Uses Bad for His Good",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/sjJ0p62TnX4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=sjJ0p62TnX4",
        "duration": "PT5M14S",
        "published_at": "2021-04-10T21:00:17Z"
    },
    {
        "title": "Marking The Times Episode 150   Another Mark of the Beast",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/zFgyQ3crpCA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=zFgyQ3crpCA",
        "duration": "PT5M28S",
        "published_at": "2021-03-05T15:48:11Z"
    },
    {
        "title": "Marking the Times Episode 149   Tribulation or tribulation",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/wmLqFWqWYM4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=wmLqFWqWYM4",
        "duration": "PT5M45S",
        "published_at": "2021-03-05T15:40:39Z"
    },
    {
        "title": "Marking the Times Episode 148   China in the End",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/6gvYccgPnk4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=6gvYccgPnk4",
        "duration": "PT7M",
        "published_at": "2021-02-15T19:15:09Z"
    },
    {
        "title": "Marking the Times Episode 147   What Now",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/D0jZfsVkNug/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=D0jZfsVkNug",
        "duration": "PT7M31S",
        "published_at": "2021-02-13T15:29:41Z"
    },
    {
        "title": "Marking the Times Episode 144   The Downfall of America",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/B2gSqrOiMv8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=B2gSqrOiMv8",
        "duration": "PT9M4S",
        "published_at": "2021-01-26T02:15:12Z"
    },
    {
        "title": "Marking the Times Episode 143   Looking For His Coming",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/Yxk-pmjjhkU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Yxk-pmjjhkU",
        "duration": "PT7M11S",
        "published_at": "2021-01-13T02:29:42Z"
    },
    {
        "title": "Marking the Times Episode 140   Rest in the Millenium",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/lGS1FBfY5AM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=lGS1FBfY5AM",
        "duration": "PT7M15S",
        "published_at": "2020-12-09T03:43:32Z"
    },
    {
        "title": "Marking the Times Episode 139   A Wrong Fit in Ezekiel 38",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/SIWSNUjNLyk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=SIWSNUjNLyk",
        "duration": "PT6M28S",
        "published_at": "2020-12-03T19:49:29Z"
    },
    {
        "title": "Marking the Times Episode 138   Power Grab",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/pQl_zabRKDI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=pQl_zabRKDI",
        "duration": "PT6M21S",
        "published_at": "2020-11-18T02:37:59Z"
    },
    {
        "title": "Marking the Times Episode 137   Cling to the Rock Not Driftwood",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/XaVEvZ_V4LA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=XaVEvZ_V4LA",
        "duration": "PT6M46S",
        "published_at": "2020-11-18T02:24:03Z"
    },
    {
        "title": "Marking the Times Episode 136   Voting Biblically",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/tiLc40CDyF8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=tiLc40CDyF8",
        "duration": "PT7M4S",
        "published_at": "2020-11-01T16:20:44Z"
    },
    {
        "title": "Marking the Times Episdoe 135   Election Encouragement",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/VIwwBE7tSVo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=VIwwBE7tSVo",
        "duration": "PT6M29S",
        "published_at": "2020-10-30T17:38:10Z"
    },
    {
        "title": "Marking the Times Episode 133   Israel's Big Decision",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/2LnsAfLmERQ/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=2LnsAfLmERQ",
        "duration": "PT5M59S",
        "published_at": "2020-10-15T13:52:42Z"
    },
    {
        "title": "Marking the Times Episode 133   Israel's Big Decision",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/a-O1v8wQJ5s/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=a-O1v8wQJ5s",
        "duration": "PT5M59S",
        "published_at": "2020-10-13T02:53:06Z"
    },
    {
        "title": "Marking the Times Episode 132   This Generation Will Not Pass",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/WIs_Wco3cKM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=WIs_Wco3cKM",
        "duration": "PT5M36S",
        "published_at": "2020-10-13T02:29:34Z"
    },
    {
        "title": "Marking the Times Episode 131   Abraham Accords Update",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/tLdJAkW-FTc/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=tLdJAkW-FTc",
        "duration": "PT5M46S",
        "published_at": "2020-09-30T23:24:07Z"
    },
    {
        "title": "Marking the Times Episode 130",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/Y538FiukOPo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Y538FiukOPo",
        "duration": "PT7M58S",
        "published_at": "2020-09-21T18:48:33Z"
    },
    {
        "title": "Marking the Times Episode 129   3 Quick Questions",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/xuI_9cGWimA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=xuI_9cGWimA",
        "duration": "PT6M4S",
        "published_at": "2020-09-12T04:51:30Z"
    },
    {
        "title": "Marking the Times Episode 129   3 Quick Questions",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/YnBLSdtIhOY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=YnBLSdtIhOY",
        "duration": "PT6M4S",
        "published_at": "2020-09-12T04:49:48Z"
    },
    {
        "title": "Marking the Times Episode 128   Who will see the Anitchrist",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/12GoDTAnX7I/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=12GoDTAnX7I",
        "duration": "PT6M3S",
        "published_at": "2020-09-12T04:41:15Z"
    },
    {
        "title": "Marking the Times Episode 127   The Abraham Accords pt 2 1",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/AhWy694us10/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=AhWy694us10",
        "duration": "PT5M24S",
        "published_at": "2020-09-04T21:08:05Z"
    },
    {
        "title": "Marking the Times Episode 126   The Abraham Accords 1",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/xWjqWWniecc/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=xWjqWWniecc",
        "duration": "PT6M26S",
        "published_at": "2020-09-04T21:02:22Z"
    },
    {
        "title": "Marking the Times Episode 126   The Abraham Accords",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/-MXFZZtmvUU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=-MXFZZtmvUU",
        "duration": "PT6M26S",
        "published_at": "2020-08-26T19:48:30Z"
    },
    {
        "title": "Marking the Times Episode 125   The 7 Spirits of Revelation",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/d54hXB5rnQk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=d54hXB5rnQk",
        "duration": "PT5M46S",
        "published_at": "2020-08-26T18:28:52Z"
    },
    {
        "title": "Marking the Times Episode 124   The Vaccine of the Beast 4",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/kvuAHvBWRIk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=kvuAHvBWRIk",
        "duration": "PT6M52S",
        "published_at": "2020-08-10T20:45:08Z"
    },
    {
        "title": "Marking the Times Episode 123   Being Lulled to Sleep",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/YI2g6la92WM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=YI2g6la92WM",
        "duration": "PT6M3S",
        "published_at": "2020-08-05T14:18:24Z"
    },
    {
        "title": "Marking the Times Episode 122   Prophecy Renewal",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/gOup5vuD7H4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=gOup5vuD7H4",
        "duration": "PT6M42S",
        "published_at": "2020-07-24T22:39:43Z"
    },
    {
        "title": "Marking the Times Episode 121   Iran Update",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/oWsppA64H8c/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=oWsppA64H8c",
        "duration": "PT5M31S",
        "published_at": "2020-07-13T02:54:45Z"
    },
    {
        "title": "Marking the Times Episode 119   Cashless Socitey",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/jc-u8mxGzMM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=jc-u8mxGzMM",
        "duration": "PT6M10S",
        "published_at": "2020-07-02T01:50:08Z"
    },
    {
        "title": "Marking the Times Episode 118   Prophecy of Elam",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/AI1KAhKZg6o/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=AI1KAhKZg6o",
        "duration": "PT6M52S",
        "published_at": "2020-06-15T16:46:50Z"
    },
    {
        "title": "Marking the Times Episode 117  Prophetic Times 1",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/-vvCQ9UVimM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=-vvCQ9UVimM",
        "duration": "PT7M22S",
        "published_at": "2020-06-09T00:44:40Z"
    },
    {
        "title": "Marking the Times Episode 1",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/2xNh-Ydsd2Y/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=2xNh-Ydsd2Y",
        "duration": "PT5M44S",
        "published_at": "2020-06-02T01:38:00Z"
    },
    {
        "title": "Marking the Times Episode 116   Millenial Bodies 2 0",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/0M7YqiXVTu8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=0M7YqiXVTu8",
        "duration": "PT5M51S",
        "published_at": "2020-06-01T16:57:01Z"
    },
    {
        "title": "Marking the Times Episode 115   Jerusalem Day",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/He9exKqF0LA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=He9exKqF0LA",
        "duration": "PT7M3S",
        "published_at": "2020-05-23T04:04:12Z"
    },
    {
        "title": "Marking the Times Episode 113   Mark of the Beast Part Two",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/jBoPQGx36Bg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=jBoPQGx36Bg",
        "duration": "PT7M10S",
        "published_at": "2020-05-11T18:15:00Z"
    },
    {
        "title": "Marking the Times Episode 112   Hebrews 9 27 1",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/9j9Rl1u87Nc/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=9j9Rl1u87Nc",
        "duration": "PT5M29S",
        "published_at": "2020-05-02T20:21:34Z"
    },
    {
        "title": "Marking the Times Episode 111   Update on Iran",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/zwpz9NvlE3k/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=zwpz9NvlE3k",
        "duration": "PT6M12S",
        "published_at": "2020-04-25T14:00:35Z"
    },
    {
        "title": "Marking the Times Episode 110   Mark of the Beast",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/rVyyjDU8ONI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=rVyyjDU8ONI",
        "duration": "PT6M30S",
        "published_at": "2020-04-21T17:36:10Z"
    },
    {
        "title": "Marking the Times Episode 109   Two New Releases",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/EgLyg4Z-Li8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=EgLyg4Z-Li8",
        "duration": "PT6M",
        "published_at": "2020-04-15T02:33:19Z"
    },
    {
        "title": "Marking the Times Episode 108   Armageddon Times",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/zQe6oKbF2l4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=zQe6oKbF2l4",
        "duration": "PT5M34S",
        "published_at": "2020-04-06T22:33:37Z"
    },
    {
        "title": "Marking the Times Episode 107   Birth Pangs 1",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/LuJXs7I7CeI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=LuJXs7I7CeI",
        "duration": "PT6M27S",
        "published_at": "2020-03-31T20:19:46Z"
    },
    {
        "title": "Marking the Times Episode 106   Psalm 11",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/5Urjh2MgQI0/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=5Urjh2MgQI0",
        "duration": "PT7M16S",
        "published_at": "2020-03-21T17:55:01Z"
    },
    {
        "title": "Marking the Times Episode 103   A Compatability Issue 1",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/Q5xnRc1KI2M/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Q5xnRc1KI2M",
        "duration": "PT5M52S",
        "published_at": "2020-03-10T02:23:26Z"
    },
    {
        "title": "Marking the Times Episode 102   Plagues and Locust",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/lOX2hLwkL8w/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=lOX2hLwkL8w",
        "duration": "PT5M36S",
        "published_at": "2020-03-07T21:09:57Z"
    },
    {
        "title": "Marking the Times Episode 101   7 Churches of Revelation",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/OYrZTHyyAZY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=OYrZTHyyAZY",
        "duration": "PT6M10S",
        "published_at": "2020-02-24T14:53:59Z"
    },
    {
        "title": "Marking the Times Episode 100   Seal Up the Prophecy",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/YoiFqe_ig1w/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=YoiFqe_ig1w",
        "duration": "PT6M36S",
        "published_at": "2020-02-19T02:16:05Z"
    },
    {
        "title": "Marking the Times Episode 99   Israeli Peace Deal",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/SE-nmbNbJZs/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=SE-nmbNbJZs",
        "duration": "PT6M30S",
        "published_at": "2020-02-13T14:46:50Z"
    },
    {
        "title": "Marking the Times Episode 98   Plagues and the End Times",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/m-4TZQla-cI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=m-4TZQla-cI",
        "duration": "PT7M13S",
        "published_at": "2020-02-05T17:58:59Z"
    },
    {
        "title": "Marking the Times Episode 97   Rumors From the North and East 1",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/A8ogG_EhQ90/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=A8ogG_EhQ90",
        "duration": "PT6M20S",
        "published_at": "2020-01-28T14:12:58Z"
    },
    {
        "title": "Marking the Times Episode 96   Prophesy of Elam",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/2u8skCEfHgY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=2u8skCEfHgY",
        "duration": "PT7M",
        "published_at": "2020-01-20T15:02:38Z"
    },
    {
        "title": "Marking the Times Episode 95   Middle East Update",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/vExfyDoRjYo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=vExfyDoRjYo",
        "duration": "PT5M37S",
        "published_at": "2020-01-06T14:09:47Z"
    },
    {
        "title": "Marking the Times Episode 94   Post Trib Rapture",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/s8jguzBCUmA/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=s8jguzBCUmA",
        "duration": "PT6M21S",
        "published_at": "2019-12-30T21:47:41Z"
    },
    {
        "title": "Marking the Times Episode 93   The Three Magi",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/wdkgF95OOYY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=wdkgF95OOYY",
        "duration": "PT5M51S",
        "published_at": "2019-12-23T11:59:00Z"
    },
    {
        "title": "Marking the Times Episode 92   Isaiah 53 1",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/aqRHUVQAf4s/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=aqRHUVQAf4s",
        "duration": "PT5M52S",
        "published_at": "2019-12-16T03:05:01Z"
    },
    {
        "title": "Marking the Times Episode 91   Middle East Update",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/Exi1Tb_5FPY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Exi1Tb_5FPY",
        "duration": "PT6M7S",
        "published_at": "2019-12-14T13:47:58Z"
    },
    {
        "title": "Marking the Times Episode 90   Resurrection of OT Saints",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/oO-ecqj4hGE/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=oO-ecqj4hGE",
        "duration": "PT6M",
        "published_at": "2019-12-11T13:13:00Z"
    },
    {
        "title": "Marking the Times Episode 89   Clarifying Matt  24 40 41",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/tGm9ae49JEI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=tGm9ae49JEI",
        "duration": "PT5M39S",
        "published_at": "2019-12-05T16:52:53Z"
    },
    {
        "title": "Marking the Times Episode 88   Who are the Two Witnesses 1",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/tS9lx0lXFM8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=tS9lx0lXFM8",
        "duration": "PT5M8S",
        "published_at": "2019-11-26T16:28:09Z"
    },
    {
        "title": "Marking the Times Episode 87   Satan and the Serpent 1",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/0He1LtlEHcM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=0He1LtlEHcM",
        "duration": "PT6M27S",
        "published_at": "2019-11-26T15:25:42Z"
    },
    {
        "title": "Marking the Times Episode 86   Timing Described in the Olivet Discourse",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/HDbdycXZaqg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=HDbdycXZaqg",
        "duration": "PT6M24S",
        "published_at": "2019-11-10T22:29:02Z"
    },
    {
        "title": "Marking the Times Episode 85   Resurrection of the Tribulation Saints",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/A77Fr4D-NHU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=A77Fr4D-NHU",
        "duration": "PT5M8S",
        "published_at": "2019-11-08T15:17:42Z"
    },
    {
        "title": "Marking the Times Episode 84   The Aligning Nations",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/GL3jgVlDDYw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=GL3jgVlDDYw",
        "duration": "PT6M29S",
        "published_at": "2019-10-21T13:34:12Z"
    },
    {
        "title": "Marking the Times Episode 83    Degrees of Punishment",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/EqPQ-sw-W3Y/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=EqPQ-sw-W3Y",
        "duration": "PT6M42S",
        "published_at": "2019-10-15T11:50:58Z"
    },
    {
        "title": "Marking the Times Episode 82   Seven Spirits Around the Throne",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/5qMenhcjhs4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=5qMenhcjhs4",
        "duration": "PT5M59S",
        "published_at": "2019-10-08T12:36:12Z"
    },
    {
        "title": "Marking the Times Episode 81   The Trumpet Feast",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/-dKrRAt4XAw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=-dKrRAt4XAw",
        "duration": "PT5M17S",
        "published_at": "2019-09-30T13:45:48Z"
    },
    {
        "title": "Marking the Times Episode 80   Iran in the News",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/G2c8XYzszOU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=G2c8XYzszOU",
        "duration": "PT5M54S",
        "published_at": "2019-09-25T19:39:49Z"
    },
    {
        "title": "Marking the Times Episode 79    Conditions for the Rapture",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/cNzUya1_kSs/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=cNzUya1_kSs",
        "duration": "PT5M34S",
        "published_at": "2019-09-16T13:47:22Z"
    },
    {
        "title": "Marking the Times Episode 78    The Fulfillment of Biblical Prophecy",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/-RM04b_Zhj0/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=-RM04b_Zhj0",
        "duration": "PT6M1S",
        "published_at": "2019-09-09T12:02:48Z"
    },
    {
        "title": "Marking the Times Episode 77   Answering Rapture Questions",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/_DJWCA9PoPw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=_DJWCA9PoPw",
        "duration": "PT6M9S",
        "published_at": "2019-09-03T18:37:14Z"
    },
    {
        "title": "Marking the Times Episode 76   The Black Horseman and Inflation",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/oefoslV-id4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=oefoslV-id4",
        "duration": "PT6M53S",
        "published_at": "2019-08-28T13:14:52Z"
    },
    {
        "title": "Marking the Times Episode 73  1",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/kpzpuRHL0c8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=kpzpuRHL0c8",
        "duration": "PT5M46S",
        "published_at": "2019-07-30T01:53:14Z"
    },
    {
        "title": "Marking the Times Episode 73",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/aOw_V4Iaml4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=aOw_V4Iaml4",
        "duration": "PT5M46S",
        "published_at": "2019-07-25T15:34:02Z"
    },
    {
        "title": "Marking the Times Episode 72",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/lfsbVvGh5Xo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=lfsbVvGh5Xo",
        "duration": "PT5M42S",
        "published_at": "2019-07-25T15:34:02Z"
    },
    {
        "title": "Marking the Times Episode 74",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/sdrtaekwCVM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=sdrtaekwCVM",
        "duration": "PT5M28S",
        "published_at": "2019-07-25T15:34:02Z"
    },
    {
        "title": "Marking the Times Episode 71   The BEMA Seat",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/XYy4tJTqaMk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=XYy4tJTqaMk",
        "duration": "PT7M4S",
        "published_at": "2019-06-21T22:10:10Z"
    },
    {
        "title": "Marking the Times Episode 70   Heavenly Rewards",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/gaGSY706euU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=gaGSY706euU",
        "duration": "PT7M10S",
        "published_at": "2019-06-21T22:10:10Z"
    },
    {
        "title": "Marking the Times Episode 66   Daniel 8",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/q58I4BzF-us/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=q58I4BzF-us",
        "duration": "PT5M50S",
        "published_at": "2019-06-17T23:01:03Z"
    },
    {
        "title": "Marking the Times Episode 64   The Boiling Cauldron",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/qQO7h1e3Lr4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=qQO7h1e3Lr4",
        "duration": "PT5M13S",
        "published_at": "2019-06-17T23:01:03Z"
    },
    {
        "title": "Marking the Times Episode 68   The Isrish Prophet Malachi",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/fIEncepjje4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=fIEncepjje4",
        "duration": "PT6M35S",
        "published_at": "2019-06-17T23:00:11Z"
    },
    {
        "title": "Marking the Times Episode 67   Healing the Unbeliever",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/qVHS-PrKv68/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=qVHS-PrKv68",
        "duration": "PT5M26S",
        "published_at": "2019-06-17T23:00:11Z"
    },
    {
        "title": "Marking the Times Episode 62   The United Roman Empire",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/s71_ErtSROw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=s71_ErtSROw",
        "duration": "PT6M31S",
        "published_at": "2019-06-17T23:00:11Z"
    },
    {
        "title": "Marking the Times Episode 69    Seeking a Rider on a Horse",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/3--1bcwxNNs/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=3--1bcwxNNs",
        "duration": "PT6M37S",
        "published_at": "2019-06-17T23:00:10Z"
    },
    {
        "title": "Marking the Times Episode 65   Gog and Magog Timeline",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/SQj9rg2FaFs/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=SQj9rg2FaFs",
        "duration": "PT6M21S",
        "published_at": "2019-06-17T23:00:10Z"
    },
    {
        "title": "Marking the Times Episode 63   Lordship Salvation",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/gqg5FZyDXXo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=gqg5FZyDXXo",
        "duration": "PT6M52S",
        "published_at": "2019-06-17T23:00:10Z"
    },
    {
        "title": "Marking the Times Episode 61: Witnesses to the Resurrection",
        "description": "Join Dr. Hitchcock as he discusses the witnesses to the Resurrection for this special Easter Edition of Marking the Times.\n\nWebsite: http://marklhitchcock.com \n\nTwitter: https://twitter.com/markhitchcock \n\nWant to ask Dr. Hitchcock a question? Message your questions to Dr. Hitchcock through his Facebook page. \n\nFacebook: https://www.facebook.com/DrMarkHitchcock",
        "thumbnail": "https://i.ytimg.com/vi/jWU6APb1c8Q/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=jWU6APb1c8Q",
        "duration": "PT6M28S",
        "published_at": "2019-04-19T16:32:07Z"
    },
    {
        "title": "Marking the Times Episode 60: Netanyahu's Re-election",
        "description": "Dr. Hitchcock discusses the significance of the re-election of Netanyahu to a 5th term.\n\nWebsite: http://marklhitchcock.com\n\nTwitter: https://twitter.com/markhitchcock\n\nWant to ask Dr. Hitchcock a question? Message your questions to Dr. Hitchcock through his Facebook page.\n\nFacebook: https://www.facebook.com/DrMarkHitchcock",
        "thumbnail": "https://i.ytimg.com/vi/3gyJwek5XZ0/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=3gyJwek5XZ0",
        "duration": "PT6M32S",
        "published_at": "2019-04-12T20:41:10Z"
    },
    {
        "title": "Marking the Times Episode 59: The Rapture",
        "description": "In this episode Dr. Hitchcock answers your questions relating to the Rapture. Will we have enough time to realize what is happening during the rapture? What will happen to children born during the Tribulation?\n\nWebsite: http://marklhitchcock.com\n\nTwitter: https://twitter.com/markhitchcock\n\nWant to ask Dr. Hitchcock a question? Message your questions to Dr. Hitchcock through his Facebook page.\n\nFacebook: https://www.facebook.com/DrMarkHitchcock",
        "thumbnail": "https://i.ytimg.com/vi/eoxFfoxLPbU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=eoxFfoxLPbU",
        "duration": "PT6M45S",
        "published_at": "2019-04-05T20:25:12Z"
    },
    {
        "title": "Marking the Times Episode 58: Loved Ones in Heaven",
        "description": "Dr. Hitchcock answers your questions about whether our loved ones can communicate with us from Heaven and how much they are aware of in regards to what is happening on Earth.\n\nWebsite: http://marklhitchcock.com\n\nTwitter: https://twitter.com/markhitchcock \n\nWant to ask Dr. Hitchcock a question? Message your questions to Dr. Hitchcock through his Facebook page. \n\nFacebook: https://www.facebook.com/DrMarkHitchcock",
        "thumbnail": "https://i.ytimg.com/vi/T7amYCg-aO8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=T7amYCg-aO8",
        "duration": "PT6M23S",
        "published_at": "2019-04-01T16:14:18Z"
    },
    {
        "title": "Marking the Times Episode 57: The Golan Heights",
        "description": "In this installment Dr. Hitchcock discusses the recent announcement of President Trump to fully recognize Israel’s Sovereignty over the Golan Heights.\n\nWebsite: http://marklhitchcock.com \nTwitter: https://twitter.com/markhitchcock\n\nWant to ask Dr. Hitchcock a question? Message your questions to Dr. Hitchcock through his Facebook page. \n\nFacebook: https://www.facebook.com/DrMarkHitchcock",
        "thumbnail": "https://i.ytimg.com/vi/z3OU_UXtx3g/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=z3OU_UXtx3g",
        "duration": "PT5M27S",
        "published_at": "2019-03-22T18:27:49Z"
    },
    {
        "title": "Marking the Times Episode 56: Rise of Antisemitism",
        "description": "Dr. Hitchcock discusses the rise of antisemitism around the world.",
        "thumbnail": "https://i.ytimg.com/vi/b0DBKzR4l48/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=b0DBKzR4l48",
        "duration": "PT6M35S",
        "published_at": "2019-03-08T23:26:39Z"
    },
    {
        "title": "Marking the Times Episode 55: Four Horseman of the Apocalypse",
        "description": "Dr. Hitchcock discusses the Four Horseman of the Apocalypse and the true identity of the rider of the White Horse.",
        "thumbnail": "https://i.ytimg.com/vi/g7R2jayksVo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=g7R2jayksVo",
        "duration": "PT6M37S",
        "published_at": "2019-03-01T21:16:04Z"
    },
    {
        "title": "Marking the Times Episode 54: Increase in Knowledge Daniel 12:4",
        "description": "Dr. Hitchcock discuses the increase in knowledge spoken of in Daniel 12:4 and how it relates to the end times.",
        "thumbnail": "https://i.ytimg.com/vi/y9LGu6NTs8A/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=y9LGu6NTs8A",
        "duration": "PT6M26S",
        "published_at": "2019-02-22T23:52:05Z"
    },
    {
        "title": "Marking the Times Episode 53: Glorified Bodies",
        "description": "Join Dr. Hitchcock as he answers your questions about what our glorified bodies might be like.",
        "thumbnail": "https://i.ytimg.com/vi/9OS5n3FMv2s/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=9OS5n3FMv2s",
        "duration": "PT5M36S",
        "published_at": "2019-02-15T21:55:31Z"
    },
    {
        "title": "Marking the Times Episode 52: A DOCUMENT ON HUMAN FRATERNITY",
        "description": "Dr. Hitchcock discusses the latest news related to Pope Francis and his signing of  \"A DOCUMENT ON HUMAN FRATERNITY' during his trip to United Arab Emirates.",
        "thumbnail": "https://i.ytimg.com/vi/crw_9HaHxR4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=crw_9HaHxR4",
        "duration": "PT6M34S",
        "published_at": "2019-02-08T21:28:23Z"
    },
    {
        "title": "Marking the Times Episode 51: Late Term Abortions",
        "description": "Dr. Hitchcock discuses the latest developments regarding late term abortions in the United States.",
        "thumbnail": "https://i.ytimg.com/vi/-8Ych16eoc0/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=-8Ych16eoc0",
        "duration": "PT7M35S",
        "published_at": "2019-02-01T23:46:07Z"
    },
    {
        "title": "Marking the Times Episode 50: Super Wolf Blood Moon",
        "description": "Dr. Hitchcock discusses the meaning of the recent Super Wolf Blood Moon and how it relates to Bible prophecy. \n\nPlease direct all questions to Dr. Hitchcock's Facebook page: https://www.facebook.com/DrMarkHitchcock/?epa=SEARCH_BOX",
        "thumbnail": "https://i.ytimg.com/vi/T7HkPASH81E/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=T7HkPASH81E",
        "duration": "PT5M55S",
        "published_at": "2019-01-25T18:56:53Z"
    },
    {
        "title": "Marking the Times Episode 49: Israel and Iran",
        "description": "Dr. Hitchcock discusses the latest event involving the ongoing conflict between Israel and Iran.",
        "thumbnail": "https://i.ytimg.com/vi/xvA8aC4gwgY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=xvA8aC4gwgY",
        "duration": "PT6M38S",
        "published_at": "2019-01-18T23:02:11Z"
    },
    {
        "title": "Marking the Times Episode 48: Fully God & Fully Man",
        "description": "Dr. Hitchcock discusses the full deity and full humanity of Jesus Christ.",
        "thumbnail": "https://i.ytimg.com/vi/MSxVTUVys-Y/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=MSxVTUVys-Y",
        "duration": "PT6M53S",
        "published_at": "2019-01-11T21:19:09Z"
    },
    {
        "title": "Marking the Times Episode 47: Rise of the Nones",
        "description": "Dr. Mark Hitchcock discusses the disturbing trend of the \"rise of the nones\".\n\nQuestions can be submitted on Dr. Hitchcock's Facebook page: https://www.facebook.com/DrMarkHitchcock/\n\nFaith Bible Church Live Stream is available here: http://faithbibleok.com/media/",
        "thumbnail": "https://i.ytimg.com/vi/CzHMa_oFPwg/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=CzHMa_oFPwg",
        "duration": "PT6M5S",
        "published_at": "2019-01-04T23:34:45Z"
    },
    {
        "title": "Marking the Times Episode 46: Synagogue of Satan",
        "description": "Dr. Hitchcock discusses the true meaning of the phrase \"Synagogue of Satan\" mentioned in the book of Revelation.",
        "thumbnail": "https://i.ytimg.com/vi/S84j_HIBaNY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=S84j_HIBaNY",
        "duration": "PT6M17S",
        "published_at": "2018-12-28T21:50:34Z"
    },
    {
        "title": "Marking the Times Episode 45: Withdrawing Troops from Syria",
        "description": "Dr. Hitchcock discusses the recent announcement by the Trump Administration to withdraw troops from Syria and how it could be setting the stage for the End Times.",
        "thumbnail": "https://i.ytimg.com/vi/Dk6Z8S2IFm0/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Dk6Z8S2IFm0",
        "duration": "PT5M50S",
        "published_at": "2018-12-21T19:47:07Z"
    },
    {
        "title": "Marking the Times Episode 44: Prophecies Leading to the Birth of Christ",
        "description": "Dr. Hitchcock discusses the prophecies leading to the birth of Christ should inform how we interpret the prophecies leading to Christs return.",
        "thumbnail": "https://i.ytimg.com/vi/ZrHDd83-nk8/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=ZrHDd83-nk8",
        "duration": "PT5M35S",
        "published_at": "2018-12-13T19:01:35Z"
    },
    {
        "title": "Marking the Times Episode 43: Special Guest Pastor Philip De Courcy",
        "description": "Join Dr. Mark Hitchcock and special guest Pastor Philip De Courcy, from Kindred Community Church, as they discuss the importance of Bible prophecy. \n\nFollow the links below if you would like to learn more about Pastor De Courcy's ministry and Kindred Community Church in Anaheim, California.\n\nKindred Community Church: https://www.kindredchurch.org/\n\nKnow the Truth: https://www.ktt.org/",
        "thumbnail": "https://i.ytimg.com/vi/f_qeS4a1-Tc/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=f_qeS4a1-Tc",
        "duration": "PT5M5S",
        "published_at": "2018-12-07T21:28:58Z"
    },
    {
        "title": "Marking the Times Episode 42: Disease During the Tribulation",
        "description": "Dr. Hitchcock discusses the Ebola outbreak in the Congo and how disease will play a role during the tribulation period.",
        "thumbnail": "https://i.ytimg.com/vi/CAc1ugEluwo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=CAc1ugEluwo",
        "duration": "PT6M2S",
        "published_at": "2018-11-30T21:42:21Z"
    },
    {
        "title": "Marking the Times Episode 41: Chinese Social Credit System",
        "description": "Join Dr. Hitchcock as he discusses the trend toward micro chipping and the Chinese social credit system.",
        "thumbnail": "https://i.ytimg.com/vi/czXFgMNeOeY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=czXFgMNeOeY",
        "duration": "PT5M4S",
        "published_at": "2018-11-20T22:34:25Z"
    },
    {
        "title": "Marking the Times Episode 40: Roman Empire & an EU Army",
        "description": "Dr. Hitchcock discusses the revived Roman empire's role in the end times and the recent call for the formation of an EU army.",
        "thumbnail": "https://i.ytimg.com/vi/2Qn90B8-Bms/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=2Qn90B8-Bms",
        "duration": "PT5M41S",
        "published_at": "2018-11-16T21:28:41Z"
    },
    {
        "title": "Marking the Times Episode 39: Saved During the Tribulation?",
        "description": "Join Dr. Hitchcock as he discuses whether or not someone can be saved during the tribulation if they have previously rejected Christ.",
        "thumbnail": "https://i.ytimg.com/vi/A3HDlN6iD4A/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=A3HDlN6iD4A",
        "duration": "PT5M38S",
        "published_at": "2018-11-08T22:53:25Z"
    },
    {
        "title": "Marking the Times Episode 38: Pittsburgh Synagogue Shootin & Antisemitism",
        "description": "Dr. Hitchcock discusses the recent shooting at a synagogue in Pittsburgh and the rise of antisemitism.",
        "thumbnail": "https://i.ytimg.com/vi/DpUDWYreTKY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=DpUDWYreTKY",
        "duration": "PT5M19S",
        "published_at": "2018-11-02T21:27:41Z"
    },
    {
        "title": "Marking the Times Episode 37: Latest Developments Between Jordan & Israel",
        "description": "Join Dr. Hitchcock as he discusses the latest developments between Jordan and Israel.",
        "thumbnail": "https://i.ytimg.com/vi/GI0EGWQrlAo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=GI0EGWQrlAo",
        "duration": "PT5M8S",
        "published_at": "2018-10-26T20:39:18Z"
    },
    {
        "title": "Marking the Times Episode 36: China in Bible Prophecy",
        "description": "Dr. Hitchcock discusses China in Bible prophecy.",
        "thumbnail": "https://i.ytimg.com/vi/PGMd5bK-UrU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=PGMd5bK-UrU",
        "duration": "PT5M23S",
        "published_at": "2018-10-19T14:15:00Z"
    },
    {
        "title": "Marking the Times Episode 35: The End Times Survival Guide",
        "description": "Dr. Hitchcock discusses his upcoming book \"The End Times Survival Guide\", Blessed Hope Prophecy Conference, and a recent Bible study on the End Times. \n\nBlessed Hope Prophecy Conference Information: https://prophecywatchers.com/conference-2018/\n\n\"About Time\" Bible Study can be streamed here: http://faithbibleok.com/media/\n\nPre-Order \"The End Times Survival Guide\" below:\n\nAmazon: https://www.amazon.com/End-Times-Survival-Guide-Strategies-ebook/dp/B07B7QF57Q/ref=sr_1_1?ie=UTF8&qid=1539361721&sr=8-1&keywords=end+times+survival+guide\n\nBarnes & Noble: https://www.barnesandnoble.com/w/the-end-times-survival-guide-mark-hitchcock/1128198749?ean=9781496414090#/",
        "thumbnail": "https://i.ytimg.com/vi/h5EVv9iLxuU/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=h5EVv9iLxuU",
        "duration": "PT4M16S",
        "published_at": "2018-10-12T16:35:09Z"
    },
    {
        "title": "Marking the Times Episode 34: Parable of the Talents",
        "description": "Join Dr. Hitchcock as he discusses the parable of the talents and whether believers could be thrown \"into the outer darkness\" as described in Matthew 25:30.",
        "thumbnail": "https://i.ytimg.com/vi/t6UDUNzyXRw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=t6UDUNzyXRw",
        "duration": "PT6M30S",
        "published_at": "2018-10-05T21:00:26Z"
    },
    {
        "title": "Marking the Times Episode 33: Latest Developments with Syria, Russia, & Israel",
        "description": "Join Dr. Hitchcock as he discusses the latest developments in Syria involving Russia and Israel. \n\nLink to article mentioned in video: https://www.the-american-interest.com/2018/08/20/the-great-middle-eastern-war-of-2019/",
        "thumbnail": "https://i.ytimg.com/vi/irqfhONzrZI/hqdefault.jpg",
        "url": "https://www.youtube.com/watch?v=irqfhONzrZI",
        "duration": "PT4M48S",
        "published_at": "2018-09-28T22:15:30Z"
    },
    {
        "title": "Marking the Times Episode 32: Faith-Based Abortion?",
        "description": "Dr. Hitchcock discusses disturbing trends related \"faith-based\" groups supporting abortion.",
        "thumbnail": "https://i.ytimg.com/vi/8Fb5ASG2Occ/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=8Fb5ASG2Occ",
        "duration": "PT7M20S",
        "published_at": "2018-09-21T17:31:00Z"
    },
    {
        "title": "Marking the Times Episode 31: Natural Disasters in the End Times",
        "description": "Dr. Hitchcock discusses natural disasters in the End Times.",
        "thumbnail": "https://i.ytimg.com/vi/FxHKz9-vL0o/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=FxHKz9-vL0o",
        "duration": "PT6M32S",
        "published_at": "2018-09-14T21:10:37Z"
    },
    {
        "title": "Marking the Times Episode 30: Ezekiel 29 & Egypt",
        "description": "Dr. Hitchcock discusses the prophecy against Egypt in Ezekiel 29.",
        "thumbnail": "https://i.ytimg.com/vi/qH8LKAcfVJI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=qH8LKAcfVJI",
        "duration": "PT6M25S",
        "published_at": "2018-09-07T19:06:57Z"
    },
    {
        "title": "Marking the Times Episode 29: Millennial Kingdom",
        "description": "Join Dr. Hitchcock as he answers your questions relating to the role of believers after the Millennial Kingdom and Christ sitting on King David's throne.",
        "thumbnail": "https://i.ytimg.com/vi/E4_e3UYQoFs/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=E4_e3UYQoFs",
        "duration": "PT5M37S",
        "published_at": "2018-08-31T20:47:10Z"
    },
    {
        "title": "Marking the Times Episode 28: Signs of Christ's Return",
        "description": "Will there be any signs preceding the rapture of the church? What are the signs of Christ's return? Join Dr. Hitchcock as he discusses these topics.",
        "thumbnail": "https://i.ytimg.com/vi/7zGSbFcDZnk/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=7zGSbFcDZnk",
        "duration": "PT5M53S",
        "published_at": "2018-08-24T21:54:55Z"
    },
    {
        "title": "Marking the Times Episode 27: Latest on Turkey, Iran, & Russia",
        "description": "Dr. Hithcock discusses the latest news concerning Turkey, Iran, and Russia.",
        "thumbnail": "https://i.ytimg.com/vi/iE8bhe3sws4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=iE8bhe3sws4",
        "duration": "PT5M24S",
        "published_at": "2018-08-17T21:02:28Z"
    },
    {
        "title": "Marking the Times Episode 26: Generations, India, & Non-Believers when Christ Returns",
        "description": "This week Dr. Hitchcock answers several questions you have sent in including \"How long is a generation?\", \"Where is India in Bible prophecy?\", \"What happens to non believers when Christ returns?\", and more.",
        "thumbnail": "https://i.ytimg.com/vi/iJQVgmLMyMo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=iJQVgmLMyMo",
        "duration": "PT6M2S",
        "published_at": "2018-08-10T22:01:11Z"
    },
    {
        "title": "Marking the Times Episode 25: Apostasy",
        "description": "Join Dr. Hitchcock as he discusses the coming apostasy or falling away that is mentioned in scripture.",
        "thumbnail": "https://i.ytimg.com/vi/KJwntqdw99Q/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=KJwntqdw99Q",
        "duration": "PT5M48S",
        "published_at": "2018-08-06T21:20:38Z"
    },
    {
        "title": "Marking the Times Episode 24: Alliance of Russia & Iran",
        "description": "Dr. Hitchcock updates you on the latest developments regarding the coming alliance of Russia and Iran.",
        "thumbnail": "https://i.ytimg.com/vi/6rhjqIahYoo/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=6rhjqIahYoo",
        "duration": "PT5M45S",
        "published_at": "2018-07-27T19:52:14Z"
    },
    {
        "title": "Marking the Times Episode 23: America in Bible Prophecy",
        "description": "Join Dr. Hitchcock as he discusses whether or not America is mentioned in the Bible.",
        "thumbnail": "https://i.ytimg.com/vi/ePI3DkBPxSw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=ePI3DkBPxSw",
        "duration": "PT6M36S",
        "published_at": "2018-07-20T17:53:33Z"
    },
    {
        "title": "Marking the Times Episode 22: Identity of the Two Witnesses",
        "description": "Join Dr. Hitchcock as he discusses who the two witnesses in the book of Revelation could be.",
        "thumbnail": "https://i.ytimg.com/vi/sELXg22U-Ag/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=sELXg22U-Ag",
        "duration": "PT7M44S",
        "published_at": "2018-07-13T18:39:02Z"
    },
    {
        "title": "Marking the Times Episode 21: Prophecies Fulfilled Before the Rapture",
        "description": "Join Dr. Hitchcock as he discusses whether or not there are any prophecies that must be fulfilled before the rapture.",
        "thumbnail": "https://i.ytimg.com/vi/7_xYxNRSKC4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=7_xYxNRSKC4",
        "duration": "PT5M1S",
        "published_at": "2018-07-06T19:54:58Z"
    },
    {
        "title": "Marking the Times Episode 20: Elections in Turkey",
        "description": "Join Dr. Hitchcock as he discusses the latest developments regarding the elections in Turkey.",
        "thumbnail": "https://i.ytimg.com/vi/zFoIcIV0M3Y/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=zFoIcIV0M3Y",
        "duration": "PT5M27S",
        "published_at": "2018-06-29T20:33:35Z"
    },
    {
        "title": "Marking the Times Episode 19: Origins of the Rapture",
        "description": "Join Dr. Hitchcock as he discusses the origins of the Rapture.",
        "thumbnail": "https://i.ytimg.com/vi/4cGl_Q5Ux7Q/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=4cGl_Q5Ux7Q",
        "duration": "PT5M33S",
        "published_at": "2018-06-14T22:56:45Z"
    },
    {
        "title": "Marking the Times Episode 18: Salvation of the Jewish People",
        "description": "In this episode Dr. Hitchcock discusses the salvation of the Jewish people.",
        "thumbnail": "https://i.ytimg.com/vi/RYA5GObItaI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=RYA5GObItaI",
        "duration": "PT5M14S",
        "published_at": "2018-06-14T22:53:08Z"
    },
    {
        "title": "Marking the Times Episode 17: America's Role in the End Times",
        "description": "Dr. Hitchcock discusses America's role in the End Times.",
        "thumbnail": "https://i.ytimg.com/vi/cnRRnsiBEII/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=cnRRnsiBEII",
        "duration": "PT5M33S",
        "published_at": "2018-06-09T19:41:22Z"
    },
    {
        "title": "Marking the Times Episode 16: 666 and the Mark of the Beast",
        "description": "Join Dr. Hitchcock as he discusses the meaning of 666 and the Mark of the Beast.",
        "thumbnail": "https://i.ytimg.com/vi/6UBCBHhkt2w/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=6UBCBHhkt2w",
        "duration": "PT6M11S",
        "published_at": "2018-06-01T21:40:33Z"
    },
    {
        "title": "Marking the Times Episode 15: Heaven and the 2 Thess 2:4 Temple",
        "description": "Dr. Hitchcock answers your questions regarding Heaven and the Temple described in 2 Thessalonians 2:4.",
        "thumbnail": "https://i.ytimg.com/vi/W2E8SC2xsVM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=W2E8SC2xsVM",
        "duration": "PT6M10S",
        "published_at": "2018-05-25T22:01:14Z"
    },
    {
        "title": "Marking the Times Episode 14",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/85jsyZNRt6c/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=85jsyZNRt6c",
        "duration": "PT3M52S",
        "published_at": "2018-05-21T16:03:44Z"
    },
    {
        "title": "Marking the Times Episode 13: Iran Nuclear Deal and Israel",
        "description": "In this episode Dr. Hitchcock discusses the latest developments with the Iran nuclear deal and Israel.",
        "thumbnail": "https://i.ytimg.com/vi/IW9gDdDuxaY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=IW9gDdDuxaY",
        "duration": "PT5M1S",
        "published_at": "2018-05-11T19:30:26Z"
    },
    {
        "title": "Marking the Times Episode 12",
        "description": "Join Dr. Hitchcock as he answers your questions.",
        "thumbnail": "https://i.ytimg.com/vi/O8Uaaf3PB5w/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=O8Uaaf3PB5w",
        "duration": "PT5M3S",
        "published_at": "2018-05-04T22:08:33Z"
    },
    {
        "title": "Marking the Times Episode 11: China's New Social Credit Score",
        "description": "Dr. Hitchcock discusses the latest news on China's new social credit score and it's relation to end times events.",
        "thumbnail": "https://i.ytimg.com/vi/OsqAegcIo8M/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=OsqAegcIo8M",
        "duration": "PT5M52S",
        "published_at": "2018-04-28T16:17:20Z"
    },
    {
        "title": "Marking the Times Episode 10: North Korea in the End Times",
        "description": "Join Dr. Hitchcock as he answers the question \"Does North Korea play a part in the End Times?\"",
        "thumbnail": "https://i.ytimg.com/vi/1N-5eUpFBHQ/hqdefault.jpg",
        "url": "https://www.youtube.com/watch?v=1N-5eUpFBHQ",
        "duration": "PT5M16S",
        "published_at": "2018-04-20T22:03:26Z"
    },
    {
        "title": "Marking the Times Episode 9: Syrian Chemical Attacks",
        "description": "Join Dr. Hitchcock as he discusses the recent news of chemical attacks in Syria and how it relates to the end times.",
        "thumbnail": "https://i.ytimg.com/vi/_n1Q8zJwLeM/hqdefault.jpg",
        "url": "https://www.youtube.com/watch?v=_n1Q8zJwLeM",
        "duration": "PT4M58S",
        "published_at": "2018-04-16T15:45:52Z"
    },
    {
        "title": "Marking the Times Episode 8",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/u9M4gGaC978/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=u9M4gGaC978",
        "duration": "PT5M22S",
        "published_at": "2018-04-06T21:37:33Z"
    },
    {
        "title": "Marking the Times Episode 7",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/Ehy-dO7d4iI/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=Ehy-dO7d4iI",
        "duration": "PT4M43S",
        "published_at": "2018-03-30T19:13:57Z"
    },
    {
        "title": "Marking the Times Episode 6",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/kM2ZWEhxHtM/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=kM2ZWEhxHtM",
        "duration": "PT5M7S",
        "published_at": "2018-03-26T21:05:39Z"
    },
    {
        "title": "Marking the Times Episode 5",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/kngxCO_tenw/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=kngxCO_tenw",
        "duration": "PT5M48S",
        "published_at": "2018-03-26T20:59:22Z"
    },
    {
        "title": "Marking the Times Episode 4",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/AQ5SoIL_D-4/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=AQ5SoIL_D-4",
        "duration": "PT5M10S",
        "published_at": "2018-03-26T20:58:19Z"
    },
    {
        "title": "Marking the Times Episode 3",
        "description": "",
        "thumbnail": "https://i.ytimg.com/vi/mjUGMIa9IbY/maxresdefault.jpg",
        "url": "https://www.youtube.com/watch?v=mjUGMIa9IbY",
        "duration": "PT5M21S",
        "published_at": "2018-03-26T20:58:13Z"
    }
]